<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイルチームにとって楽しさは重要か</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/11/fun-important-agile-teams"><em>原文(投稿日：2013/11/07)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>アジャイルチームで働くのはストレスフルになる場合がある。例えば、顧客のニーズが不明瞭であったり、やらなければならなかったことがたくさんあったり、チームのメンバが困難に直面したりする場合だ。楽しさはストレスを低減し、モチベーションを増やし、生産性をあげるのだろうかという疑問を持つこともあるだろう。これが正しいのなら、アジャイルチームに楽しさを持ち込むにはどうしたらいいのだろうか。</p> 
  <p><a href="http://agileyammering.com/2013/07/31/are-you-having-fun/">are you having fun?</a>という記事で、Valerie Santillo氏はなぜアジャイルチームにとって楽しさが大切なのか説明している。</p> 
  <blockquote> 
   <p>チームメイトと一緒にいるのが楽しいときはよいチームにいるということです。私の場合、楽しく仕事をするのはとても重要なことです。とても難しく楽しくもないプロジェクトも経験してきましたが、くだらない仕事にもかかわらず素晴らしい時間を過ごすことができました。</p> 
   <p>スクラムマスターとして、チームのメンバの笑い声を聞けるのは素晴らしいことです。働いている人が楽しいのなら、仕事も好きになるでしょうし、よりしっかりと働くでしょう。最終製品も良いものになるはずです。楽しくないのなら、やり方を考え直した方がいいです。ハッピーアワーを一緒に過ごしたり、散歩に出かけたり、インタラクディブで魅力的な(そして少しばかばかしい)チームエクササイズを実行しましょう。</p> 
  </blockquote> 
  <p>Alex Krause氏も<a href="http://www.core-dump.net/management/my-top-10-learnings-as-a-product-owner/">top 10 learning's as a product owner</a>という記事で楽しさと成功を祝うことについて書いている。</p> 
  <blockquote> 
   <p>ミーティングに楽しさを持ち込めば、ミーティングはますます楽しくなります。ミーティングが参加して楽しいものになれば、だれもが参加したくなります。そして、成功を祝うことを忘れないでください。スプリントのレビューにキャンディを持ち込みましょう。大きなリリースの後はビールかシャンパンです。</p> 
  </blockquote> 
  <p>Ian Mitchell氏はスプリントのレビューとは何か、どのようにすればいいのかについて<a href="https://sites.google.com/site/wicmitchell/home/sprint-reviews-in-practice">sprint reviews in practice</a>というブログ記事で書いている。スプリントレビューに楽しさを持ち込むとレビューが行われる機会も増える。</p> 
  <blockquote> 
   <p>クッキーや飲み物を持ち込みましょう。レビューのところどころに短い運動やゲーム休憩を挟みましょう。居酒屋クイズみたいなものが人気のようですが、勝った人に小さなご褒美をあげるケースもあります。</p> 
  </blockquote> 
  <p>Catia Oliveira氏は<a href="http://scrumplicity.wordpress.com/2012/08/07/scrum-master-tip-6-retrospectives-2/">Scrum Master TIP #6 – Retrospectives</a>というブログ記事で、結果を残すために激務を遂行する人はなぜ振り返りが嫌いなのかを説明している。</p> 
  <blockquote> 
   <p>振り返りでは、チームのメンバは人間関係について聞かれ、“最後のスプリントでうまくいかなかったこと”の総括と対処方法の策定を求められます。つまり失敗したことについてです。(…) 期日や範囲を守れなかったり、ソフトウエアではなくてバグをリリースしてしまったりするのは、純粋な嫌な失敗なのです。明らかに、毎日、一生懸命働いたのですから、そのような過去の失敗を振り返るのは嫌でしょう。そんなことについて話したりするのが簡単で楽しいことだと思いますか。</p> 
  </blockquote> 
  <p>スクラムマスターの仕事は振り返りのときにチームのメンバを楽しませることだ。Catia氏は次のように書く。</p> 
  <blockquote> 
   <p>振り返りを楽しくしましょう。恥ずかしくないものにし、格式張らず、つらくないようにします。失敗を話やすくします。一緒に楽しみ成長しやすくします。</p> 
  </blockquote> 
  <p>InfoQは近頃、<a href="http://www.infoq.com/news/2013/10/roleplaying-games-agile-coaching">ロールプレイングゲームのダンジョンマスタとして学んだことをアジャイルコーチングに活用する</a>ことについて、Guillaume Duquesnay氏にインタビューし、幸せと楽しさの重要さについて語ってもらった。</p> 
  <blockquote> 
   <p>幸福さや楽しさといったものを (より多くの価値を提供する，という意味の) 生産性と結びつけるのは，少し慎重になる必要があると思います。私の始めた方法はそうではなく，それらを目標に結びつけます。目標の実現が人々を幸せにする，という考え方なのです。楽しさという点は，パフォーマンス上のトリガだとは思いません。改善の前には，時には厳しいことも言わなければなりません。(…) 責任を取ることは楽しいことではありません。共同責任ならばなおさらです。信用できる人からのフィードバックは楽しくなくても，ストレートで思いやりに満ちています。</p> 
  </blockquote> 
  <p><a href="http://flowchainsensei.wordpress.com/2013/06/13/hyper-joyful/">hyper-joyful</a>というブログ記事で、Bob Marshall氏は職場での喜びとうれしさについて書いている。</p> 
  <blockquote> 
   <p>私はソフトウエア開発や製品開発の世界(ほかの多くの職場でも同様ですが)で喜びにフォーカスがあたっているとは思いません。</p> 
  </blockquote> 
  <blockquote> 
   <p>この記事のタイトルを“hyper-joyful”としたのは“hyper-productivity”という概念に対するリアクションです。“hyper-productivity”は最近、私が何度も議論していることです。“hyper-productive”という言葉を聞くたびに、私は軽蔑的で残念で悲しい気持ちにならざるを得ません。アジャイルはそのような野心的目標を達成するものではありません。一体、誰が“hyper-productivity”という言葉からよい気持ちを受けるのでしょうか。(…) 個人的には、“hyper-joyful”について仲間たちが話しているときのほうが幸せな気分になります。</p> 
  </blockquote> 
  <p><a href="http://rgalen.com/agile-training-news/2013/9/16/the-agile-project-manager-can-agile-teams-get-burned-out">can agile teams get &quot;burned out&quot;?</a>というブログ記事で<a href="http://www.infoq.com/author/Robert-Galen">Robert Galen氏</a>がチームが燃え尽きてしまうときの原因と指標について、そしてチームのリフレッシュについて書いている。燃え尽きの指標のひとつはユーモアと楽しさの欠如だ。チームが集中しすぎているとこのような欠乏状態に陥りがちだ。氏はリフレッシュやチームの再配置についていくつかの提案をしている。そのひとつが“Go Have Fun”だ。</p> 
  <blockquote> 
   <p>オフィスを出て、チームが楽しめることをしましょう。チームとしてでも個人としてでもかまいません。私は楽しむために集まることに力を割いているチームを知っています。また、チームのメンバ家族とともに特別な時間を過ごすことを認めているチームも知っています。この両方を実施しているチームもあります。アジャイルリーダーとして、私はチームの活動に資金提供することもあります。チームのメンバに対する私からの条件は楽しい時間を過ごし、ストレスを発散することです。</p> 
  </blockquote> 
  <p>自分自身が欲しているものがわかっていない顧客とともに働くチームはフラストレーションがたまりがちだ、と指摘するのはRudi van der Made氏だ。氏は<a href="http://agilethings.nl/scrum-is-fun/">Scrum is fun</a>というブログ記事でスクラムがどのようにしてこの問題に対処するかを説明している。</p> 
  <blockquote> 
   <p>(…) スクラムの人気と成功は、この手法がフラストレーションに対処し、解決してくれることのおかげです。複雑なチームワークを楽してくれ、副産物として品質と生産性が得られるのです。</p> 
  </blockquote> 
  <p>コミュニケーションを改善するのがスクラムをより楽しくする第一の秘訣だ。例えば、開発者に毎日スタンドアップを実施させる。</p> 
  <blockquote> 
   <p>何度かやってみると、静かに一人で黙々と作業するのが好きな開発者もコミュニケーションをし始めるのがわかります。各自の仕事に少しだけ定期的なミーティングを入れるだけでこれだけ大きなことが得られるのです。より生き生きとした職場環境になりますし、その結果楽しさも増します。</p> 
  </blockquote> 
  <p>そして、ビジネスサイドの関与を大きくすることが第二の秘訣だ。</p> 
  <blockquote> 
   <p>プロダクトオーナを継続的に関与させることも優れたスクラムの実践のひとつです。すべての利害関係者とコミュニケーションし、プロダクトバックログを管理するのはプロダクトオーナの重要な仕事です。しかし、スプリントのときに開発チームに関与するのもプロダクトオーナの重要な仕事です。スプリントの終わりにそのプロダクトが&uml;リリース可能&uml;かどうか判断するのはプロダクトオーナが関与するしかありません。</p> 
  </blockquote> 
  <p>アジャイルチームにとって楽しさは重要だろうか。チームに楽しさをもたらすためにあなたは何をしたか。</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>