<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイルチームのペアコーチング</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/01/pair-coaching-agile-teams"><em>原文(投稿日：2014/01/09)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>アジャイルコーチはひとりでコーチするとは限らない。ペアを組んでコーチする，という方法もある。ふたりのコーチが協力して，アジャイルを採用する個人やチームに対して，その習得と改善を支援するのだ。</p> 
  <p>Stephan Schwab氏は<a href="http://www.stephan-schwab.com/coaching/2013/09/12/risks-and-side-effects-of-agile-coaching.html">アジャイルコーチングのリスクと副次的効果</a>について，あるブログ記事を書いた。その中で氏は，コーチが指導を始めるとき人々が，それに恐れを抱く理由について説明している。</p> 
  <blockquote> 
   <p>現在の状況を続けたとしても，クライアントにとってはあまりプラスにはならないでしょう。コーチが姿を現した瞬間，何か課題が生まれるのです。何らかの変化が起こることは避けられません。逆にそうでなければ，コーチを呼んだ意味がありません。何も手を加えないのであれば，支援をする術もないのですから。</p> 
   <p>ですからコーチは，そこら中を見回して隅々まで探し回ったり，質問をしたりして，普段の状況に潜んでいる真実を見つけ出そうとします。すでに廊下で，誰かと話をしているかも知れません。そのような行動はこそこそ嗅ぎ回っているとか，他人のビジネスに口出ししようとしているという受け取られ方をするかも知れません。他の人たちとっては，そのような行動が脅威に受け取られる可能性があるのです。</p> 
  </blockquote> 
  <p>氏はコーチングが取り組むべき２つの面について言及している。これらを組み合わせるのは難しいかも知れない。</p> 
  <blockquote> 
   <p>アジャイルコーチの場合，技術的な側面と心理的な側面が存在しています。技術面に関しては他のアクティビティと同じです。新技術が導入されてさまざまな数値が計測され，その結果が可視化されていきます。しかし心理面は他のアクティビティとは違います。変化への対応を支援するためのものなのです。もし変化を起こそうとする人と，それによって影響される人たちを支援する人が同一人物であったならば，彼らはコーチと信頼関係を結ぶより先に，不満を言う可能性の方がずっと高いでしょう。</p> 
  </blockquote> 
  <p>氏の提案はコーチを２人にすることだ。</p> 
  <blockquote> 
   <p>一切の変化を導入しない役割のパートナーとペアでコーチを行う方法が，この問題のよい解決策になるかも知れません。彼らの感じる不安に対処するのは，その人の役目にするのです。彼らの言うことにいつでも耳を傾けて，不安を理解する唯一の人になることで，彼らとの信頼関係を築くことができるのです。しかし一方でその人は，もうひとりのコーチが導入しようとしている変革についても，その背景となる理由を理解しています。ですからその新たな考え方，仕事を成功させる新たな方法への移行の実現を，<em>別の面から</em>支援することもできます。</p> 
  </blockquote> 
  <p>ペアコーチングでは，ふたりのコーチが連携して個人またはチームをコーチする。それぞれがコーチングの異なる側面に注目するのだ。コーチは皆それぞれ，独自の経験やスキルを備えているので，彼らはお互いを補完することができる。それによって提供するコーチングの質と価値を高めることが，ペアコーチングの目的だ。</p> 
  <p>InfoQでは以前，<a href="http://www.infoq.com/interviews/whelan-agile-coaching-lean-startup">Declan Whelan氏にアジャイルコーチングとリーンスタートアップ，アジャイルアライアンスについて</a>インタビューしたことがある。インタビューの中で氏は，ペアコーチングが望ましい理由を次のように説明してくれた。</p> 
  <blockquote> 
   <p>私たちがストレスに感じるのは，例えばあるセッションを進めようというとき，開始時間や終了時間の正確さを気に掛ける人，参加者の積極性に強く執着する人，あるいはセッションルームの快適さを気にしたり - つまり内容を重視する人と，セミナーのダイナミズムを重視する人がいる，ということです。</p> 
  </blockquote> 
  <p>氏はペアで作業することのメリットについて，次のような話をした。</p> 
  <blockquote> 
   <p>(...) 人の話を聞くという点では，私よりも上手な人が他にいます。あるいは何か別のものに注目しているときに，私が気付いていないものを気付かせてくれたり，そんな “ああ，なるほど” と思う瞬間などは，ボディランゲージに注目しているとか，誰が誰を見ているかを気にしているとか，そんな感じの – 自分だけではなかなか気付かない，微妙なインタラクションがあるのです。ストーリポイントのような技術的な視点に捉われていると，得てして見落としてしまうものなのですね。個人としての私は，自分自身の思い込みや弱さといった，いわば克服すべき課題を持った存在です。他のコーチに “Declan, 確認してみよう。私が気付いたのはこんな点だが，あなたはどう思っていたのかな？“ と言われたりします。第３者がいれば，私自身のゲームのバーはかなり上がります。クライアントはそんなことはしません。まずしないでしょう，そうですよね？ しかし他のコーチとペアを組めば，そのような会話も心配なくできるでしょう。ゲームの質も間違いなく向上すると思いますよ。</p> 
  </blockquote> 
  <p>Yves Hanoulle氏は<a href="http://www.infoq.com/articles/agile-lean-mindset">アジャイルとリーンの考え方についてのInfoQのインタビュー</a>で，コーチをする企業の社員とのペアを次のように説明している。</p> 
  <blockquote> 
   <p>(...) 内部の人と一緒にコーチをしたい，と言っています。その際に話すのは，“その人をコーチしてスクラムやアジャイル，XPについての多くを教えると同時に，その人が会社の文化や物事の進め方を教えてくれる” という点です。その意味から言えば，私とその人には別々の役目があることになりますね。(...) 私にとって大切なのは，私の持つ知識がその会社に確実に根付くことです。そこに所属する人とベアを組むことで，私の行っていることだけでなく，その背景にある意図も確実に把握してもらえるのです。</p> 
  </blockquote> 
  <p>読者はペアコーチングの経験をお持ちだろうか？それはアジャイル採用に有効だっただろうか？</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>