<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>改善の習慣</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/12/habit-of-improving"><em>原文(投稿日：2013/12/13)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p><a href="http://www.xpday.net/">XP Days Benelux 2013 カンファレンス</a>において、アジャイルは1つの考え方であり、すべてを連続して改善していくものだと、Yves Hanoulle氏が語った。Yves氏は、<a href="http://www.slideshare.net/YvesHanoulle/the-power-of-habits-28572828">改善のパワー</a>に関するセッションの進行役となり、人々が人生の中でどのように習慣を生み出したり、変化させたりできるかについて議論した。</p> 
  <p>InfoQは、人々が持つ習慣や改善の習慣を身に付けるためにできることについて、Yves氏にインタビューした。</p> 
  <p><strong>InfoQ: チームが改善の習慣を身に付ける必要があるとのことですが、その理由は?</strong></p> 
  <blockquote> 
   <p><strong>Yves氏: </strong>すべての状況に最適なプロセスはありません。チームが現在の状況でうまくいっている時に、チームが働く方法を変えなければ、将来の状況ではうまくいかないでしょう。</p> 
   <p>長期的には、&quot;悪い&quot;チームであっても、改善の習慣を身に付けていけば、そのような習慣を持たないチームを打ち負かせます。</p> 
  </blockquote> 
  <p><strong>InfoQ: 実際に習慣を持つのはチーム、または、組織でしょうか? それとも、チームメンバ、つまり、習慣を持っている人でしょうか?</strong></p> 
  <blockquote> 
   <p><strong>Yves氏: </strong><a href="http://charlesduhigg.com/the-power-of-habit/">習慣のパワー</a>という本の中で、Charles Duhigg氏は私たちの行動の40%以上が習慣だと言っています。</p> 
   <p>Charles氏は、また「個人は習慣を持ち、グループはルーチンを持つ」といいます。<br /> 会社を作った人が始めた文書化されていないルーチンを、その人がすでにいなくなっているにも関わらず、続けている人々がいる組織を、私は自分の目で見てきました。</p> 
   <p>今、それは必ずしも悪いことではありません。これらのルーチンが会社をユニークなものにしていると言えるのだと思います。このようなルーチンに従って、人はマクドナルドやスターバックスに行きます。ルーチンによって、私はアメリカで買うものと同じようなものをベルギーで買います。<br /> そして、習慣を持つ人が会社を去る時には、おそらく何らかの習慣を持っていきます。</p> 
  </blockquote> 
  <p><strong>InfoQ: 習慣を変えることで、どのようにアジャイルの考え方を発展させられますか?</strong></p> 
  <blockquote> 
   <p><strong>Yves氏: </strong>この本の中に素晴らしい例があります。安全習慣に注目して、CEOがどのように会社の考え方の方向を変えたかが述べられています。この質問は、私に「ベストキッド」のことを思い出させます。「ワックスを塗って、ワックスをとる」というこの映画の有名な部分をご存じでしょう。</p> 
   <p>基本的に、この映画の中でトレーナーがさせたことは、習慣に集中することです。動作が習慣になるようにしたのです。そして、いつも改善しようとする考え方と、集中力、献身が身に付きました。これは、どのチームにとってもよいスタートになります。</p> 
  </blockquote> 
  <p><strong>InfoQ: 講演の中で、習慣を変えることの黄金律について話されました。そのことについて、もっと聞かせてください。</strong></p> 
  <blockquote> 
   <p><strong>Yves: </strong>はい。ただし、詳細を学ぶには、ぜひとも、みなさんにCharles氏の本を買っていただきたい。私が説明するよりも、Charles氏はずっと上手に説明しています。</p> 
   <p>習慣を変えることに関する黄金律を理解するには、習慣の詳細を理解することが重要です。</p> 
   <p>習慣は、以下のものから生み出されます。<br /> - きっかけ (本の中では、手掛かりと呼ばれる) <br /> - ルーチン (チームのルーチンと混乱しないように) <br /> - 見返り</p> 
   <p>大抵の人は、習慣を変えたい時には、全体を置き換えたいと考えます。習慣を変えることの黄金律によれば、ルーチンを置き換えるだけのほうがずっとよいでしょう。喫煙をチューインガで代用するように。(または、ニコチンパッチを使います)</p> 
  </blockquote> 
  <p><strong>InfoQ: 成功する組織の習慣はなんですか?</strong></p> 
  <blockquote> 
   <p><strong>Yves: </strong>それは、会社によって様々だと思います。<br /> そもそも成功する会社というものが何かによります。私が言う成功する会社は、読者が言う成功する会社ではないかもしれません。私は、個人的にトヨタがしていることが気に入っています。私にとって、トヨタは習慣を変える文化、または、習慣を変える習慣を作り出しました。私が共に働いた本当のアジャイルチームは、同様の習慣を持っていました。この本には、どのようにスターバックスが習慣を作り出したかという例が含まれています。</p> 
  </blockquote> 
  <p><strong>InfoQ: なぜこれらの習慣によって成功するのですか?</strong></p> 
  <blockquote> 
   <p><strong>Yves: </strong>習慣は予想可能で繰り返されるため、習慣によって人々や会社は成功できます。</p> 
   <p>習慣の利点の1つは、脳の考える必要性が減ることです。応急処置や消防訓練で習慣に注目するのには、理由があります。ストレスを受けた時の対応方法を私たちに教えたいのです。そうして得られた貴重な数秒が、人々の生死を分けることもあります。</p> 
   <p>スターバックスのコーヒーがどこに行っても同じであることで、海外の街や国に行ったときに慌てることはありません。ここで、スターバックスの人達は考えることを許されていないと言っているのではありません。トヨタとは異なり、自分たちのプロセスを変えると考えられています。</p> 
  </blockquote> 
  <p><strong>InfoQ: <a href="http://www.infoq.com/articles/agile-lean-mindset">アジャイルとリーンの考え方</a>に関するInfoQの以前のインタビューで、ペアコーチングについて話しています。ペアコーチングも習慣を変える効率的な方法ですか?</strong></p> 
  <blockquote> 
   <p><strong>Yves: </strong>初めに言いたいのは、私はさまざまな方法を知っていますが、それらの方法をいつでも適用できる訳ではありません。そうは言っても、ペアコーチングは、私自身を変えるのにとても役に立ちます。</p> 
   <p>私はすべてのトレーニングをペアでする習慣に取り組んできました。例えば、自分のアジリティワークショップを他の国で行う場合に、私と一緒に教えたい人がいないかどうか主催者に尋ねます。私は、その人とトレーニングの準備をします。誰かと一緒にするのです。一緒にすることはなかったはずの人とワークショップをするのは、私にとって、すべてがチャレンジになります。</p> 
   <p>私とワークショップ参加者たちが得るものは、私がいつも気を張っていることです。トレーニングはすべて違うものになり、常に最新です。そして、必要があれば、お互いを頼りにできます。</p> 
  </blockquote> 
  <p><strong>InfoQ: 組織や習慣の変化に関する個人的な例はありますか?</strong></p> 
  <blockquote> 
   <p><strong>Yves氏: </strong>私にとって、組織で習慣を変えるえることは、視覚的な管理から始まります。状況と習慣を視覚化することで、組織の人々は、それらのことを異なる方法で考え、自分たちの習慣を変え始めます。例えば、私はチームで大きな砂時計を使います。まず、ミーティングや話し合いの時間を決め、次に、ミーティングルームにその砂時計を見えるように置きます。そして、退屈だと感じたら、希望する時間の砂時計を回し、その時間が終わったら、その話題について話し続けたいかどうか、チームで話し合うように提案します。こうして、人々に時間に対する責任を持たせます。</p> 
   <p>チームメンバは、退屈だという手掛かりをすでに与えています。そして、それ以上注意を払わず、後で文句をいう習慣があります。おそらくみんなに文句を言うことが、見返りになります。</p> 
   <p>ある組織では、各ミーティングルームにこの砂時計を注文しました。私は、最高のフィードバックを得ました。CEOが個人的に私に感謝しにやってきて、取締役会の時間が半分になり、よりよい議論が行われるようになったと言ったのです。</p> 
  </blockquote> 
  <p><strong>InfoQ: チームで習慣を変えたい場合、推奨する他の方法はありますか?</strong></p> 
  <blockquote> 
   <p><strong>Yves氏: </strong>本から学んだ最高のトリックは、小さな変化で大きな影響を与えられることです。現在の習慣をよく見て、理解し、その習慣を変えられるかどうか考えます。小さな習慣を変える共通点を見つけ、習慣を変える習慣を少しずつ人々に教えます。</p> 
   <p>このように、低いところにぶらさがっているフルーツから始めるのがよい方法です。<br /> コーチとして、私は、人々が少しだけ変化するようにしています。そして、思っていたよりも自分の人生をコントロールしていると感じるようにします。そうすると、人々は徐々に人生全体を変えていきます。私のウォーキングデスクのように、私は一日により多くの最初の一歩を踏み出すようになりました。私は知らずに走り始め、気づいたときには5kmレースを走っていました。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>