<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>プロダクトバックログのためのプロセスマップとストーリマップ</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/04/backlog-process-story-maps;jsessionid=AADD942172007B0A93832763D097790F"><em>原文(投稿日：2013/04/11)へのリンク</em></a></p> 
<div class="clearer-space">
 &nbsp;
</div> 
<div id="newsContent"> 
 <p>プロダクトバックログの体系化は，ユーザストーリの概要を把握し，全体像を見るためには有効な方法だ。Shrikant Vashishtha氏のブログ記事 <a target="_blank" href="http://www.agilebuddha.com/agile/story-mapping-andvs-process-maps/">ストーリマッピングとプロセスマップ (story mapping and/vs process maps)</a> には，ユーザストーリをプロセスマップにマッピングするための方法が説明されている。その記事で氏は，ユーザストーリを体系化するための方法としてのプロセスマッピングアプローチを，<a target="_blank" href="http://www.infoq.com/author/Jeff-Patton;jsessionid=E05033892FFA430457BEC51A8B1EFF81;jsessionid=AADD942172007B0A93832763D097790F">Jeff Patton</a>氏の提唱するストーリマッピングと比較してみせている。</p> 
 <p>スクラムでのプロダクトバックログは，プロダクトに対するニーズを管理するために使用するものだ。 大規模なプロダクトの場合には，バックログに多数のユーザストーリが登録される可能性がある。そうなると概要をまとめたり，全体を把握する作業が困難になる。さらにはユーザストーリの数が多くことによって，チームのスプリントバックログにも同じようなことが起きる可能性もある。</p> 
 <blockquote> 
  <p>(...) 何回も壁の掲示板 (スクラムボード) を見るのですが，状況はちっともクリアになりません。ToDo，進行中，完了というステータスを書き込んだユーザストーリで埋められて，まるで網目のようです。しかも重要な問題の中には，ユーザストーリを見るだけでは答が得られないものもあるのです。</p> 
 </blockquote> 
 <p>プロダクトバックログの体系化とユーザストーリの視覚化を行う手段としてVashishtha氏が提案するのは，プロセスマッピングの実施だ。</p> 
 <blockquote> 
  <p>ビジネスフロー全体をプロセスマップとして図示して，その中にユーザストーリ (実施すべき仕事) を関連付けてみてはどうでしょう？</p> 
 </blockquote> 
 <p>プロセスマップにはユーザストーリのIDを記入する。このIDは，プロセスの各部分を実装するために使用されるものだ。プロセスマップを見れば，ビジネスフローに必要なユーザストーリを確認することができる。色分けをすることで，ビジネスフローの進捗を可視化することも可能だ。</p> 
 <p>大規模なプロダクトバックログを体系化するもうひとつのアプローチはストーリマッピングだ。Jeff Patton氏の2008年の記事 <a target="_blank" href="http://www.agileproductdesign.com/blog/the_new_backlog.html">新たなユーザストーリバックログとしてのマップ (the new user story backlog is a map)</a> にその説明がある。</p> 
 <blockquote> 
  <p>実施順に並べられたユーザストーリは，システムの目的を第３者に説明するための役には立ちません。&quot;開発中のシステムは何をするものですか？” と関係者やユーザから質問されたときは，ユーザストーリバックログを彼らに渡してみてください。私の考えでは，システムを – システム全体を理解しようとすることは，ソフトウェア開発の困難な部分のひとつです。アジャイルチームでもっともよく聞かれる苦情のひとつは，全体像を見失ってしまう，という点です – 最初に全体像が見えていたならば，という条件はありますが。</p> 
 </blockquote> 
 <p>氏は全体像を伝える手段として，ストーリマッピングがいかに有効かを説明する。</p> 
 <blockquote> 
  <p>情報の拡散手段として張り出されたストーリマップが，開発しているプロダクトを議論する上での出発点として利用できることに気付いたのです。プロジェクト進行中は，スプリントやイテレーションの計画ボードとしても使えます。次のイテレーションで開発するストーリをマップ上で確認したり，チェックを入れたりするのです。イテレーション中は，現在行っているストーリをタスク表に移動して，開発管理を行います。その時にもストーリマップは計画表に残っていますので，全体像や現在の位置を確認することができるのです。</p> 
 </blockquote> 
 <p>InfoQでは以前にも，ストーリマップがプロダクトバックログの体型化に役立つというテーマで，<a target="_blank" href="http://www.infoq.com/jp/news/2009/04/story-map;jsessionid=E05033892FFA430457BEC51A8B1EFF81;jsessionid=AADD942172007B0A93832763D097790F">ストーリー・マッピングによるユーザ・ストーリーへのコンテキスト付与</a> という記事を書いている。</p> 
 <blockquote> 
  <p>ストーリー・マップは2次元であり，ストーリーの優先度に加え，ストーリー間の関係やユーザのより大きなゴールとの関係も表しています。このマップは，いかにストーリーを組み合わせてリリース可能な製品を形成するか，チームが理解するのに有効です。</p> 
 </blockquote> 
 <p>Shrikant Vashishtha氏は，プロセスマッピングの効果を説明した <a target="_blank" href="http://www.agilebuddha.com/agile/story-mapping-andvs-process-maps/">ストーリマップとプロセスマップ (story mapping and/vs process maps)</a> の後，プロセスマッピングとストーリマッピングを比較した記事を自身のブログに載せている。その中で氏は，プロダクトバックログがストーリマッピングによってどのようになるか，次のように述べている。</p> 
 <blockquote> 
  <p>ストーリマッピングのアイデアは，プロダクトバックログをマップ上の &quot;ビッグストーリ&quot; (&quot;ユーザアクティビティ&quot;，エピック，フィーチャなどとも呼ばれる) で表現する，というものです。ビッグストーリはさらに，ユーザタスク (誰かが達成すべき何か) に分割されます。</p> 
 </blockquote> 
 <p>ストーリマップを使用した経験から，氏はいくつかの欠点を指摘する。</p> 
 <blockquote> 
  <p>ストーリマップは優れた情報拡散手段ですが，リリース全体のストーリを表すとなると，必要なスペースが大きくなりすぎるかも知れません。またストーリ間の関係や，ビジネス上の目標を達成するためにエピック/ストーリ全体がどのような編成になっているか，といった情報については，必ずしも表現することができないのです。</p> 
 </blockquote> 
 <p>ストーリマップでは全体像を把握することが難しいほど複雑な場合は，プロセスマップの助けを借りるとよい，と氏は指摘する。プロセスマップではすべての詳細部分を示していないからだ。</p> 
 <blockquote> 
  <p>すべてのストーリをボードに置く代わりに，プロセスマップの大きなポスターを貼りだして，ユーザストーリのIDを配置するのです。プロセスマップ自体が背景図の役割も果たして，皆で同じページを参照したい場合には役立つでしょう。</p> 
 </blockquote> 
 <p>結論として述べられているのは，大規模なプロダクトバックログの体系化にはプロセスマップとストーリマップのいずれも利用可能である，ということだ。</p> 
 <blockquote> 
  <p>(...) プロセスマップとストーリマップは，同じ問題を解決するためのまったく違うコンセプトに思えるかも知れません。しかし，そうではないのです。どちらもボードを明確にするためのツールであり，コンテキストに対応して，お互いを補完し合うものとして利用できます。</p> 
 </blockquote> 
 <p><a target="_blank" href="http://www.techwell.com/2013/03/user-story-mapping-goal-driven-backlog-development">ユーザストーリマッピング - 目標駆動バックログ開発 (user story mapping―goal-driven backlog development)</a> と題したブログ記事には，Scott Sehlhorst氏によるストーリマッピングの概要説明がある。最初に氏が示しているのは，その目的だ。</p> 
 <blockquote> 
  <p>ユーザストーリマッピングは，リリースあるいはイテレーション毎に製品が確実によくなることを保証するためのテクニックです。(...) ユーザストーリマッピングには，問題解決のためにユーザが実行している，あるいは実行しようとしているプロセスと，ユーザが目標を達成するためのバリューチェーンやワークフローの明確な理解が必要です。</p> 
 </blockquote> 
 <p>さらに氏は，ストーリマッピングを行う方法と，それによるメリットについて説明する。</p> 
 <blockquote> 
  <p>ユーザストーリマッピングによって，グループが実行するユーザストーリあるいはタスクを組織化し，価値提供のために実行すべき要件全般を特定することが可能になります。要件の <em>網羅性</em> を評価する上で，これは強力なテクニックです。さらに，ユーザが問題を解決，ないしはより効率的に解決可能にすることにより，各リリースあるいはイテレーションが価値を付加することを保証するためのツールにもなります - 問題の解決半ばでの提供を防止できるのです。</p> 
 </blockquote> 
 <p>読者はストーリマップ，あるいはプロセスマップを使ったプロダクトバックログの体系化を行っているだろうか？それらは概要を把握し，全体像を見る上で役に立っているだろうか？</p> 
 <p id="lastElm">&nbsp;</p> 
</div> 
<p id="lastElm"></p><br><br><br><br><br><br></body></html>