<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>CMMIを使用した成果主導の改善プロセス</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/12/benefits-led-improvement-cmmi"><em>原文(投稿日：2013/12/10)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>CMMIを基盤とするプロセス改善プログラムでは，多くの場合，特定の成熟度レベルの達成を目標に据える。組織としては，成熟度レベルとビジネス上の目標との関連性を見通し，改善によって期待できるビジネス上のメリットを知ることが重要になる。SITAでProject Portfolioのディレクタを務めるMichelle Krupa氏は，<a href="http://www.sepg.unicom.co.uk/">SEPG Europe 2013</a>カンファレンスで，認証主導(certification-led)から成果主導(benefits-led)に改善プログラムを移行する上での課題をテーマとして講演を行った。</p> 
  <p>氏は講演で，CMMI成熟度レベルを基本としていた自分たちの改善プログラムを，成果を主眼点としたアプローチに変更した，と説明している。InfoQでは氏にインタビューして詳しい話を聞いた。</p> 
  <p><strong>InfoQ: インタビューにご協力頂き，ありがとうございます。</strong><strong>SITAを知らない読者のために，どのような事業を行っているのか説明して頂けますか？</strong></p> 
  <blockquote> 
   <p><strong>Michelle: </strong>SITAは，航空輸送や世界規模の流通システム，政府関係のユーザを対象に，世界でもっとも広範なネットワークでのビジネスソリューションの提供と管理を行っています。特に航空輸送業界(ATI / Air Transport Industry)に対しては，通信とITサービスのポートフォリオを提供すべく，業界団体とも協力関係を持っています。ATIとの協力の下，情報技術アプリケーションと通信サービスに関する革新的な開発を実施しています。</p> 
  </blockquote> 
  <p><strong>InfoQ:改善プログラムの目標はCMMI成熟度レベル３を取得することでした。なぜ，この目標が選択されたのでしょう？</strong></p> 
  <blockquote> 
   <p><strong>Michelle: </strong> そのようなレベルの成熟性を達成するには，ソフトウェア開発や品質管理を行う組織に品質や納期，あるいは成果達成の面での再現性が必要になります。それが理由でしょうね。</p> 
  </blockquote> 
  <p><strong>InfoQ: 改善プログラムは，ビジネス上の理由から開始されたものにも関わらず，後になって予算がカットされていますね。これにはどのように対処しましたか？</strong></p> 
  <blockquote> 
   <p><strong>Michelle: </strong>大した問題ではありませんでした。許された予算の中で，やるべきことの何ができるのかを見直してみたのです。外部のプロセスコンサルタントに頼らず，内部リソースを活用する方法を探したところ，SEIトレーナの認定を持った主任鑑定士が社内にいたため，トレーニング並にコストを節約することができました。</p> 
   <p>この過程で私たちは，社内の知識や経験だけでは限界があることを実感しました。社内の主任鑑定士の協力が得られなくなったので，単に経験を持っているだけでなく，私たちの組織文化にマッチしたコンサルティング会社の力を借りて，そのギャップを埋めることにしました。</p> 
  </blockquote> 
  <p><strong>InfoQ:&nbsp;&quot;困難なものを避ける&quot;という話をされていましたが，それについて詳しく説明して頂けますか？</strong></p> 
  <blockquote> 
   <p><strong>Michelle: </strong>私たちは当然のように，無意識で困難を避け続けていました。 意図していたのではありません。改善プロセスはML2の目標をすでに達成していましたし，そのプロセスに沿ったものでしたが，測定にはあまり効果がありませんでした。意味のあるものを測定したというより，測定できるものを測定していたのです。私たちは組織の奥深くを調べました。その結果，プロセスに沿っているように思えたプロジェクトが，実はチームに根付いていなかった，ということに気付きました。プロジェクトマネージャというよりも，プロセスマネージャだったのです。</p> 
  </blockquote> 
  <p><strong>InfoQ: 成熟度レベル３という当初の目標を維持しながら，改善プログラムのフォーカスを変更するために，どのようなことを行ったのですか？</strong></p> 
  <blockquote> 
   <p><strong>Michelle: </strong>ビジネスケースに立ち戻ったのです。プログラムの目的と理由について，改めて見直しました。最終的な目標はML3の達成でしたが，それは同時に，一連のメリットを提供するためでもあったのです。</p> 
   <p>SITAの戦略的ビジョン，SITAの戦略的目標を見つめ直し，プログラムのメリットを戦略的目標へと方向付けました。プログラムのスポンサーである上級副社長のところに行って，スポンサーと社内ユーザのメリットのために共に作業し，すべてを彼に報告しました。主要なメリットの指標を定義した上で，現在はKPIのサポートを定義中です。ソリューションラインの副社長たちがそれぞれ，KBIとKPIの定義と同意に詳細レベルで関与しています。</p> 
  </blockquote> 
  <p><strong>InfoQ: 講演では，プログラムのターゲットが再定義された件について述べていますが，新しいターゲットは何でしょう，どのようなメリットがあるのでしょうか？</strong></p> 
  <blockquote> 
   <p><strong>Michelle: </strong>現在の目標は，これまで説明したようなメリットの実現と投資利益率に向けられています。ML3がゴールであることには変わりありませんが，メリットを提供することの方が当面の主眼点です。 これによって，正しい方向に注意を向けることができます。プログラムに影響を与える可能性のあるものをビジネスの言葉で語ることで。ソリューションラインの副社長たちに，プログラムに投資することの価値を認識してもらうことができるのです。その結果として，プログラム全体の可視化と戦略的重要性が向上します。</p> 
  </blockquote> 
  <p><strong>InfoQ: 今回の改善プログラムで得た教訓の中で，InfoQの読者に伝えたいものはありますか？</strong></p> 
  <blockquote> 
   <p><strong>Michelle:</strong> 私たちが学んだことは:</p> 
   <p>認定のために改善プログラムを進めないこと</p> 
   <p>ビジネスが改善プログラムに何を求めているか理解し，それを実現すること</p> 
   <p>測定を滞らせないこと，さもなくば改善の方向性を見失うことになる</p> 
   <p>透明性と説明責任は，時に傷つけられることがあっても，あなたの友人である</p> 
   <p>スポンサーシップは非常に重要，政治力を駆使できることが必要だ</p> 
   <p>プロセスの展開に対処せよ，それなくして結果は得られない</p> 
   <p>プロセスの実施と成果の獲得は同じではない</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>