<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>Yahoo!の在宅勤務禁止に対する反応</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/03/Yahoo-stop-remote-work;jsessionid=1AAB9EDFBB1CC9BF3C0DC5A528988606"><em>原文(投稿日：2013/03/01)へのリンク</em></a></p> 
<div class="clearer-space">
 &nbsp;
</div> 
<div id="newsContent"> 
 <p>Yahoo!が従業員に出社して業務に従事するよう要求することに決めたことに、在宅勤務のコミュニティから疑問の声が上がった。これは形を変えたレイオフなのか。遠隔労働の管理の仕方についての誤解なのか。Yahoo!にとって正しい決断なのか。</p> 
 <p>1週間前、Yahoo!のPeople and Development部門のエクゼクティブバイスプレジデントであるJackie Reses氏が全従業員に<a target="_blank" href="http://allthingsd.com/20130222/physically-together-heres-the-internal-yahoo-no-work-from-home-memo-which-extends-beyond-remote-workers/#">メモ</a>を送り、今後は在宅勤務を許可せず、すべての従業員は6月から通勤できるオフィスに出社して働くように通達した。氏は“コミュニケーションとコラボレーションが重要になるので、並んで働く必要がある”と主張し、Yahoo!の在宅勤務者は十分な働きをしていないと暗に示唆している。“在宅勤務によってスピードと品質が常に犠牲にされています”</p> 
 <p>Yahoo!は顧客サポート、マーケティング、エンジニアリングなどすべての部門で多くの在宅勤務者を抱えている。Business Insiderによれば、多くの在宅勤務者は生産的ではない。以前Yahoo!でエンジニアとして働いていた人物によれば、“私は在宅勤務禁止を支持します。Yahoo!では在宅勤務が濫用されています。Yahoo!にとっては具体的な問題です”</p> 
 <p>Yahoo!の広告技術のエクゼクティブだったMichael Katz氏も今回の決定を支持ている。</p> 
 <blockquote> 
  <p>コミュニケーションとコラボレーションが改善されたことによる優れた集合知が人間同士のコミニュケーションの価値です。</p> 
  <p>意味のあるやり取りが意味のある(利害関係者に対する)価値に変化するでしょう。</p> 
 </blockquote> 
 <p>Business Insiderはこの動きが“Yahooの従業員を困惑させている。あるワーキングマザーはCEOであるMarissa Mayer氏と同じようにオフィスに育児室を設けられる余裕があったら、と言っている”と伝えている。Mayer氏は昨年の秋、出産をし“<a target="_blank" href="http://www.businessinsider.com/marissa-mayer-who-just-banned-working-from-home-paid-to-have-a-nursery-built-at-her-office-2013-2">オフィスに育児室を設けた</a>”。“もし、妻が子供とベビーシッターをつれて出社して、机の隣であやしていたらどうなってしまうのでしょう”、とあるYahoo!の在宅勤務者の夫は言う。</p> 
 <p>“Mayer氏の考えに近い情報筋”はこの発表をYahoo!の従業員を削減して“レイオフでないレイオフ”を実施し、“15年間で太り怠惰になった”現在の“巨大で膨れ上がったインフラ”を健康する機会と捉えている。</p> 
 <p>Yahoo!の在宅勤務に対する今回の発表は技術コミュニティ内である種のリアクションが生まれている。Microsoftの従業員で5年在宅で働いているScott Hanselman氏はブログで<a target="_blank" href="http://www.hanselman.com/blog/BeingARemoteWorkerSucksLongLiveTheRemoteWorker.aspx">自分がYahoo!の従業員なら辞めている</a>と述べている。“もし私がYahooの従業員で在宅で働いていて、今回のメモを受け取ったらすぐに辞めているでしょう。おそらく、直感的に辞めると思います。モチベーションが下がるとはこのことです”</p> 
 <p>なぜ、Yahoo!の今回の発表には3つの理由が見られると氏は言う。</p> 
 <blockquote> 
  <ul> 
   <li>マネジメントが十分に貢献していないと考えているだろう遠隔勤務者にソフィーの選択を与え、効率的な強制人員削減を行うことで労働力を削減するという隠された意図。遠隔地勤務の方針を変えるだけなら、この動きをレイオフと呼ばずに済みます。</li> 
   <li>遠隔地勤務者自身の自己認識と価値の提供の仕方に対する完全かつ全体的な過失と誤解</li> 
   <li>Yahooが従業員の生産性と成果を計測するきちんとした方法を持っていないという明確な証拠</li> 
  </ul> 
 </blockquote> 
 <p>氏はYahoo!のどこかの時点で内部の信頼が失われたと考えている。</p> 
 <blockquote> 
  <p>しかし、究極的にはこの決定は信頼に帰着します。信頼は企業の方針の1つ1つによって生まれたり、損なわれたりするものです。あなたはプロフェッショナルとして雇われています。プロフェッショナルとして信頼されていますか。遠隔地で働くには企業はあなたのことを、見ていなくても働き、さらにチームのメンバと物理的に頻繁にやり取りしなくても仕事ができる人として信頼しなければなりません。</p> 
 </blockquote> 
 <p>作家で講演者でもあるScott Berkun氏は<a target="_blank" href="http://scottberkun.com/2013/in-defense-of-remote-work-and-marrisa-mayer/">Yahoo!がすべての人に同じ計測方法を適用することは間違い</a>で将来、反動が起きると書いている。</p> 
 <blockquote> 
  <p>経営者が一方的にクリエイティブな人々の働き方を決めるのは間違っています。何百人の大人のプロフェッショナルがどのように働くのがベストなのかを知っていると思うのは、自分が親、従業員が子供と見なしているということです。自主性を好む最も有能な社員は会社を去るでしょう。有能ではなく、依存心の高い従業員が残ります。</p> 
 </blockquote> 
 <p>Yahoo!は在宅勤務の従業員がスピードと品質を犠牲にしているという点を示すデータを持っていないと氏は考えている。しかし、スピードや品質が犠牲になっているのは“おそらく事実だ”と氏は考えている。最終的にはこの動きはYahoo!を助けるのではないかというのが氏の意見だ。</p> 
 <blockquote> 
  <p>彼女[Mayer]はCEOであり、自分の企業で何が置きているのかを私たちよりも知っています。私たちは外から見ているだけです。仕組みに対するショックことがYahooに必要なことで、在宅勤務を標的にしたのは“目覚めて、シェイプアップせよ”という彼女のメッセージを大音量で聞かせるための方法だったのでしょう。</p> 
 </blockquote> 
 <p>Yahoo!が先端的でなくなり、ウェブのフロントランナーでもなくなり、何か手を打たなければならないのは自明なことだ。在宅で働きたい、あるいは働かなくてはならない人の中には会社を去る人もいるだろう。残る人は6月から毎日出社する。この動きが従業員削減の一環なら、無差別に人員を削減してしまうことになるので不適当な方法だ。企業と文化を再生するのが目的なら、今後数年で同社がどこへ向かうのか注視する必要がある。いずれにせよ、在宅勤務のあり方に一石を投じる動きであり、従業員に在宅勤務を認めるのを考え直すマネージャも現れるだろう。</p> 
 <p id="lastElm">&nbsp;</p> 
</div> 
<p id="lastElm"></p><br><br><br><br><br><br></body></html>