<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>安定したチーム作りと機能不全なチームの対処</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/04/stable-teams;jsessionid=4D03A075D893D98C628CDAEB28A52908"><em>原文(投稿日：2013/04/04)へのリンク</em></a></p> 
<div class="clearer-space">
 &nbsp;
</div> 
<div id="newsContent"> 
 <p>複数のプロジェクトにわたる安定したチームを持つことは、アジャイルソフトウェア開発にとってプラスになる。安定したチームがあると、プロジェクトの開始時に新しいチームを作って終了時に解散するのではなく、仕事は既存のチームに対して作られ与えられる。だが、もし安定したチームが期待通りに機能しない場合には、どうすればよいのだろうか？ 安定したチーム作りとその育成について、また機能不全なチームの対処について、さまざまな人がブログに記事を書いている。</p> 
 <p>Joe Little氏は「<a target="_blank" href="http://www.leanagiletraining.com/blog/better-agile/we-want-a-stable-team/">we want a stable team</a>」というブロク記事で、安定したチームを持つことは重要だと考える理由について説明している。</p> 
 <blockquote> 
  <p>(…) すばらしいプロダクトを考え出すためには、何か特別なものが必要になります。私は最近、この「特別なもの」というのは、すぐれたチームから生まれる可能性が高いと思っています。したがって、ビジネスマネジメントの観点から（納得しなきゃいけないのはマネージャですから）、安定したチームは必要なんです。</p> 
 </blockquote> 
 <p>Joe氏は、チームにはビジネス側の人間と技術側の人間の両方が必要だという。そうしたチームで仕事をするのは、楽しくて満足感があるはずだという。もしすばらしいチームができているなら、それをキープするよう彼は提案する。</p> 
 <blockquote> 
  <p>（すばらしいチームは）5倍から10倍よい仕事をします。 (…) これは金の卵を生むガチョウです。 (…) 満足のいく仕事を与え続ければ、それを変える必要はないかもしれません。</p> 
 </blockquote> 
 <p>安定したチームのためには、仕事の作り方を変える必要がある。</p> 
 <blockquote> 
  <p>もう、プロジェクトから始めて、プロジェクトに取り組む人を探すのではありません。チームから始めて、チームにとってよい仕事を探すのです。</p> 
 </blockquote> 
 <p>Everett Zufelt氏は「<a target="_blank" href="http://www.myplanetdigital.com/article/building-teams-avoiding-dysfunctions">building teams &amp; avoiding dysfunctions</a>」というブログ記事を書いた。そのなかで彼は、チームの機能不全と育成方法について調べている。彼はまずチームを定義することから始めている。</p> 
 <blockquote> 
  <p>(…) ただ同じプロジェクトに取り組む人の集まりと、共通の成果に向かって取り組むチームとの間には雲泥の差があります。チームは共通の目標に気を配って、チームのエゴのために自分のエゴを犠牲にするのです。</p> 
 </blockquote> 
 <p>クライアントにより多くの価値を届ける強いチームを育成するには、チームメンバーがお互いのことを知る必要がある。Everett氏は仕事をする人と知り合うようになると、いかにチームの育成が簡単になるかを説明している。</p> 
 <blockquote> 
  <p>最近、私たちは「安定した」チームという目標を立てました。これはシフトや変化をしないチームを意味しているのではありません。チームの大きさと構成における変化に注意を払っているということです。ほかにも利点はありますが、安定性というのは集団としての成果に気を配ることのできるチーム作りの重要な部分だと思っています。</p> 
 </blockquote> 
 <p>Roman Pichler氏は、<a target="_blank" href="http://www.romanpichler.com/blog/roles/stable-teams/">安定したチーム</a>作りのおすすめを紹介している。彼はまず、安定したチームを求める必要性について説明している。</p> 
 <blockquote> 
  <p>チーム構成を頻繁に変えることは、個人と組織にとって望ましいことではありません。チームが活躍するには、安定性が必要です。アジャイルの世界では、市場、要件、技術が頻繁に変化しますが、安定したチームは安全性と継続性をもたらします。</p> 
 </blockquote> 
 <p>プロダクトのリリース内およびリリースを越えて、チームに対する変化を最小限にするようアドバイスする。</p> 
 <blockquote> 
  <p>チーム構成を変更すると、チームビルディングのプロセスをまた最初から始めることになります。それによって、生産性と自己組織化が損われます。 (…) チームメンバーの大部分がプロダクトに取り組み続けられるようにしましょう。そうすれば、情報のロスや欠陥、遅延が避けられます。</p> 
 </blockquote> 
 <p>Kelly Waters氏は「<a target="_blank" href="http://www.allaboutagile.com/the-value-of-stable-teams/">the value of stable teams</a>」という記事で、安定したチームをサポートする組織体制について説明している。彼女はそうした体制を作ることがいかに価値あることかを説明している。</p> 
 <blockquote> 
  <p>シニアマネージャとして、開発チームに対して最もやるべき価値あることの1つは、安定したチームを可能とする組織体制を作ることです。ずっと続くチームを、プロジェクトのために集められて、新しいプロジェクトを作るために解散させられるチームではなく。</p> 
 </blockquote> 
 <p>Kelly氏は、チームビルディングにおける「成立期、動乱期、安定期、遂行期」というステージについて説明している。チームがこうしたステージを通過するにはある程度時間がかかる。</p> 
 <blockquote> 
  <p>いきなり意気投合し、途中少しだけ緊張もあるでしょうが、非常にすばやくこのプロセスを通過するチームもあります。これに対し、動乱期からずっと抜け出せず、本当にチームとして動けるようになるまで、かなり時間のかかるチームもあります。</p> 
 </blockquote> 
 <p>組織として、安定したチームをどのようにサポートできるのだろうか？ Kelly氏は最初から届けられる製品を取り上げる。</p> 
 <blockquote> 
  <p>(…) チームを特定のプロダクトやプロダクトポートフォリオに合わせるのが一番です。そうすれば、毎回チームを再構築する必要なく、最適化済みの関係、プロセス、ベロシティという利点を活かして、プロダクトからプロダクトへと一緒に動けます。人をプロジェクトにアサインし、毎回新しいチームを作るのではなく、プロジェクトを実績あるチームにアサインするのです。</p> 
 </blockquote> 
 <p>Steve Martin氏は「<a target="_blank" href="https://www.valueflowquality.com/the-dysfunctional-agile-team-member/">the dysfunctional agile team member</a>」という記事で、チーム構成の変更方法について書いている。まず彼は、場合によっては、チームからメンバーを外すという選択肢も検討する必要があると説明している。</p> 
 <blockquote> 
  <p>(…) クライアントの多くはチームの入れ替えを望んでいません。それは聖域です。「チームは変えられないんです。これが私たちなんです。ほかにはいません。以上。」私だったらこう言います。「チームを変更できます」。いいえ、だれかを解雇すればいいと言っているのではありません（とはいえ例外的に、こういうはっきりした行動をとる場合もあります）。そう、チームメンバーの組み換えは頻繁にやるべきことではありません。でも場合によっては、チーム、ステークホルダー、そして顧客の利益のために、チームメンバーを入れ替える必要があるのです。</p> 
 </blockquote> 
 <p>Steve氏はチームの変更を検討するのに、各メンバーの能力と意欲のマトリックスを使っている。</p> 
 <blockquote> 
  <p>能力とは、コーディングスキル、テスティングスキル、ビジネス分析スキルなどの「技術的スキル」とアジャイルの価値と原則の<em>実践</em>を指しています。意欲とは、スキルの「人間」部分 – コラボレーション、変化への対応、フィードバック、（専門家としてでなく）1つのチームとしての仕事をすること、など基礎となるアジャイルの価値と原則をいかにオープンに受け入れ、賛同しているかを指しています。</p> 
 </blockquote> 
 <p>最優先なのは、能力と意欲を合わせ持つチームメンバーだ。能力は低いが意欲の高いチームメンバーは、ペアと一緒に技術的スキルを養うことができる。能力は高いが意欲の低いチームメンバーには、意欲を高めるために個人的コーチングをしてもよいし、チームメンバーではなくてチームのコンサルタントにしてもよい。能力も意欲も低いチームメンバーについては、チームから外す必要があるか検討しなくてはならない。</p> 
 <blockquote> 
  <p>結局、能力も意欲も低い人には、最初から腹を割って話をしなくてはなりません。たとえ最初のスプリントであっても、こうした人たちにはチームから完全に抜けるよう頼みます。こうしたやり方はマネジメントから非常にネガティブに反応される場合がありますが、時間がたてば、特にチームが機能するようになってくれば、そういう反応もなくなります。</p> 
 </blockquote> 
 <p id="lastElm">&nbsp;</p> 
</div> 
<p id="lastElm"></p><br><br><br><br><br><br></body></html>