<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>チームの改善のためにベロシティを計測することへの懸念</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/04/concerns-velocity-improvement"><em>原文(投稿日：2014/04/03)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>アジャイルチームは自分たちのスプリントごとのベロシティを計測する。そうすることで彼らは、計画をたて、進捗をトラッキングし、プロダクトオーナーにプロダクトのリリースプランを作るための手がかりを与えることができるようになる。チームは、自らを改善したいときに、ベロシティのデータを利用できるのだろうか？ 何人かの著者がベロシティについて書いており、チームの生産性を高めることを目的としてベロシティを計測することについての懸念を伝えている。</p> 
  <p>Catia Oliveira 氏はScrum AllianceのWebサイトで「<a href="http://www.scrumalliance.org/community/articles/2014/february/velocity">チームとプロダクトに役立つベロシティの計測と活用のしかた</a>」について書いた。彼女は、ベロシティの計測がチームにとってどんな役に立つのかについて、このようにまとめている。</p> 
  <blockquote> 
   <p>自分たちのベロシティがわかれば、こんなことがわかるようになるでしょう。</p> 
   <ul> 
    <li>どれだけの価値を今までに届けたか（ストーリーポイントや完成したユーザーストーリーでいうと）</li> 
    <li>いつプロダクトバックログに含まれるすべてのユーザーストーリーを届けられるのか</li> 
    <li>ストーリーポイント何ポイント分をある期日までに届けられるか</li> 
   </ul> 
  </blockquote> 
  <p>また、彼女はベロシティに影響する可能性のある要因をリストアップしている。</p> 
  <blockquote> 
   <ul> 
    <li>道路封鎖 -- 障害、インペディメントとも</li> 
    <li>燃料 -- モチベーション、私たちを駆り立てるもの</li> 
    <li>ドライバーの経験 -- 開発者の知識、技能、適性</li> 
    <li>車のコンディション -- 開発環境</li> 
    <li>視界 -- プロジェクトの透明性</li> 
    <li>方向 -- プロジェクトの目標</li> 
    <li>交通規則/運転規則 -- プロセス</li> 
    <li>目的地 -- プロダクト</li> 
   </ul> 
  </blockquote> 
  <p>George Dinwiddie氏は「<a href="http://blog.gdinwiddie.com/2014/03/04/tracking-velocity/">ベロシティをトラッキングする</a>」という記事をブログに書いた。彼はチームによるベロシティの計測は、自分たちが今どんな風にやっているかを知る手がかりになるので便利だと説明している。しかし生産性を測ることを目的としてベロシティデータを利用することについてはこのように警告している。</p> 
  <blockquote> 
   <p>ベロシティについて言えば、これは生産性の相似形では<strong>ありません</strong>。そう思ってしまう罠に陥るのは簡単です。“28ポイントというのは、あるスプリントで私たちが完成させることのできる仕事量です。” ただし、28ポイントは単なる仕事量ではありません。これは見積りです。（中略）私たちはストーリーポイントをもっと大きく見積もるとか、あるいは作業をもっと小さなストーリーにスライスすることで（訳注：ストーリーポイントでなくストーリーの数で見積もる場合）、簡単に操作することができるのです。これは実に簡単で、私たちは知らず知らず、あるいまた意図的にそうすることができてしまいます。</p> 
  </blockquote> 
  <blockquote> 
   <p>（中略）ベロシティは生産性をざっくりトラッキングできるかもしれませんが、これを使ってさらに生産性を上げようとした途端に、私たちにはトラッキングできないものになるのです。</p> 
  </blockquote> 
  <p>2012年、Tim Ottinger氏は「<a href="http://agileotter.blogspot.ca/2012/09/14-weird-observations-about-agile-team.html?">アジャイルチームのベロシティにまつわる14個の奇妙な見解</a>」という記事をブログに書き、ベロシティについて彼がよく聞かれる質問とそれに対する答えをリストにした。彼はまず、ベロシティの計測は可能でも、それを直接コントロールすることはできない、と述べている。</p> 
  <blockquote> 
   <p>ベロシティは計測器であって調整ノブではありません。ベロシティを単に上げるということはできないのです。努力することによって計測器を壊すことができるだけです。</p> 
  </blockquote> 
  <p>チームのパフォーマンスが上がったことと計測されたベロシティとの関連は複雑になりうる、とTim氏は説明している。</p> 
  <blockquote>
   チームが改善すれば、ベロシティは上がりストーリーポイントはだいたい同じままか、もしくはベロシティは概ね同じままストーリーに振られる見積りが減るかになるでしょう。しかし、ある程度はどちらも同時に起きるというのが非常によくあることです。チームをまたいでベロシティを比較してはいけないという理由の1つはこれです（他にもたくさんの理由はあるでしょうけど）。
  </blockquote> 
  <p>Jeremy Jarrell氏はブログ記事「<a href="http://www.jeremyjarrell.com/velocity-is-not-the-goal/">ベロシティはゴールではない</a>」の中で、アジャイルチームにとって予測可能なベロシティを持つことがなぜ重要となり得るのかを説明している。</p> 
  <blockquote> 
   <p>高いベロシティを連続して叩きだすチームは、多くの場合、組織にとって価値があるものとして扱われます。しかしこういったチームは、あるスプリントで高いベロシティを叩きだしたかと思えば次のスプリントでは急降下するといったように不安定になりがちで、最初に思ったより価値は高くないかもしれないのです。</p> 
   <p>その理由は、<em>ベロシティ</em>が<em>予測可能性</em>よりも価値の高いものではないからです。私たちがアジャイルなやり方でやることの大半は、自分たちのチームの予測可能性を高める目的で実行されます。チームの予測可能性が高まれば高まるほど、将来に向けてより効果的に計画ができるようになるのです。これによって私たちはより賢くリスクを取ることができ、また同時に、与えられた時間枠の中で届けられそうなものをベースにした、より現実的な戦略を練ることができるようにもなるのです。</p> 
  </blockquote> 
  <p>Jeremy氏は、チームがベロシティを高めつつ予測可能性をもっと上げたい時の解決策を提示している。</p> 
  <blockquote> 
   <p>このことは、チームがベロシティを生み出すよう努力してはならないということを意味しているのでしょうか？ まったく違います。チームのベロシティを高めることが目的であってはならないという意味です。それよりもチームは、ベロシティを上げるために必要な素質そのものにフォーカスすべきです。エンジニアリングプロセスを継続的に改善するとか、リスクを系統的に識別し追い出すといったプラクティスは、自然とベロシティを上げることになるのです。</p> 
  </blockquote> 
  <p>Nathan Dintenfass氏はブログ記事「<a href="http://productsarehard.com/deconstructing-agile-part-1-language-of-agile-is-broken/">アジャイルの用語は破綻している</a>」の中で、チームの生産性を上げるためにベロシティデータを使ったときのリスクについて言及している。</p> 
  <blockquote> 
   <p>生産性の定量化が可能なものさしとしてのベロシティ。これは、ほとんどのチームがそのやり方を変えるときに設定して始めるゴールそのものに悪影響を与えます。マネージャーたちはベロシティを上げたいがために、より多くのストーリーポイントを&quot;done&quot;にすればボーナスを与えるといったようなやり方をしがちです。こういった言動はまったくもって見当違いです。チームがポイントを水増ししたりする理由を与えられたり、あるいは逆に、数字自体が目的で合計をより大きく出すことを考えついた場合は、インセンティブは明らかに腐敗しているからです。私たちが本当に欲しいものは、与えられたサイクルの中で&quot;done&quot;にできるものを、正確に、かつ自信を持ってきっちり読み取るための、相対的な難しさについての正直な見積りです。ベロシティがまっとうな見積り（ひいてはコミットメント）を達成するための手段ではない何かに成り下がってしまったら、良いソフトウェアの生産には最終的に悪い影響を与えるのです。</p> 
  </blockquote> 
  <p>Tim Ottinger氏は「<a href="http://agileotter.blogspot.ca/2012/09/14-weird-observations-about-agile-team.html?">アジャイルチームのベロシティにまつわる見解</a>」の中でこう結論を下している。</p> 
  <blockquote> 
   <p>ベロシティに関する最大の問題は、ベロシティを理解していないことから生じるのでも、ベロシティを生産性や多忙さの一般的な指標として扱うことから生じるのでもありません。その秘訣は、そんなに深刻的に捉えないこと、そして、ベロシティを上げようとするのではなく仕事の仕組みや組織を改善することなのです。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>