<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>スクラムへの盲信</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/11/scrum-kool-aid"><em>原文(投稿日：2013/11/06)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>Brian de Haaff氏のブログ <a href="http://blog.aha.io/index.php/the-holy-scrum-war/">The Holy “Scrum” War (スクラム聖戦)</a> には，「スクラムが企業を救う」という主張は間違いではないか，という氏の主張が論じられている。</p> 
  <p>一部の人々がスクラムに対して抱く宗教的情熱に敬意を表しながらも，氏はそのような &quot;スクラム狂信者&quot; が存在する理由についても知るべきだ，と説明した上で，主な動機として次の２つを指摘する：</p> 
  <blockquote> 
   <p><b>#1 エンジニアはもの作りが好きである</b></p> 
   <p>発明家とエンジニアのいない世界があるでしょうか？ あるとすれば，今でも洞窟で狩猟と採取を続けているような世界でしょう。私たちの世界を作り上げたのはエンジニアたちです。私のよく知るエンジニアたちは，そのようなもの作りを目標としています。エンジニアがもの作りに集中できるようにする上で，スクラムは非常に優れた方法です。スクラムは現実的かつ実用的でビジネス品質のソフトウェアをスプリントに分割して，優先順位付けて提供するためのフレームワークを提供します。ひとつのことをやり遂げて作業リストから削除する，という行為には達成感があります。延々と続く作業リストを作り出して，完成すべき次の作業を常に用意するのがスクラムなのです。スクラムのToDoリストは尽きることがありません。</p> 
   <p><b>#2 エンジニアは怒られるのが好きではない</b></p> 
   <p>現実的な話をしましょう。怒られるのが好きな人はいません。エンジニアリングマネージャやチームにとってスクラムは，作業の完了時期を予測できない，という理由で怒られないようにする上で役立ちます。スクラムは日程優先(date driven)ではないからです。スクラムは &quot;納期こそが問題だ&quot; という概念を抑制します。エンジニアにとっては，特定の日付までに提供するというプレッシャを受けることなく，ひとつの機能が完了したら次の機能へと，順序よく移行する手段を与えてくれるのがスクラムなのです。</p> 
  </blockquote> 
  <p>While Brian氏はスクラムについて，プロダクトをどのようにエンジニアリングするかを定義し管理する実証された手法であると認めながらも，優れたプロダクト，あるいは優れた企業を構築するために必要なインプットを定義していない点を問題として指摘する。</p> 
  <blockquote> 
   <p>スクラムによる本当の変化は，それがイノベーション，つまり優れたプロダクトを提供する手段として広く受け入れられたときに，初めて起きるのだと思います。優れたプロダクトは &quot;what(目的)&quot; を含んだ &quot;why(理由)&quot; で始まり，&quot;how(手段)&quot; によって実現されます。スクラムはその &quot;how&quot; を提供するための極めて洗練されたメソッドであり，効率という概念を開発の製造工程に導入して，一定の環境で正しく運用する方法なのです。</p> 
   <p>しかしながらスクラムは，プロダクトが市場で勝利を収める魅力を備えるための，戦略的手段としての &quot;why&quot; を教えてはくれません。</p> 
  </blockquote> 
  <p>スクラムの基本的な考え方のひとつとして，スクラムは &quot;why&quot; を知るための魔法ではない，というものがある。Ken Schwaber氏は &quot;<a href="http://books.google.com/books?id=RpYX01XVMksC&amp;pg=PT92&amp;lpg=PT92&amp;dq=The+minimum+plan+necessary+to+start+a+Scrum+project+consists+of+a+vision+and+a+Product+Backlog.+The+vision+describes+why+the+project+is+being+undertaken+and+what+the+desired+end+sta">Agile Project Management with Scrum</a>&quot; の中で，ビジョンが不可欠である点を指摘している。</p> 
  <blockquote> 
   <p>スクラムプロジェクトを開始するには，最低限でもビジョンとプロダクトバックログがなければなりません。ビジョンとは，そのプロジェクトになぜ着手するのか，求められる結果は何なのか，といったことを説明するものです。</p> 
  </blockquote> 
  <p>&quot;why&quot; を知ることなく &quot;エンジニアが次の戦略ばかり気にするようならば，スクラムはこのための障害にもなり得ます&quot; とBrian氏は断言する。Ilan Goldstein氏はAxis Agileの<a href="http://www.axisagile.com/blog/planning-and-metrics/your-product-vision-in-scrum/">記事</a>で，プロダクトのビジョンがなければ，チームの関心は &quot;what&quot; や &quot;how&quot; といった，彼らが知っていることに集中してしまうということを示している。</p> 
  <blockquote> 
   <p>ある ‘もの’ に飛び付いて開発したいという願望によって，スクラムチームが’what’ (プロダクトバックログ)と ’how’ (スプリントバックログ) にすべての意識を集中してしまうことは多々あります。これは馬の前に荷車を置くようなものです。‘what’ あるいは ‘how’ を考える前に，’why’ を真剣に検討しなくてはなりません。‘why’ はプロダクトバックログやスプリントバックログからは見つかりません。むしろプロダクトビジョンのような，明確に独立した作成物の中に見出されるものなのです。</p> 
  </blockquote> 
  <p>Brian氏は，&quot;スクラムのクールエイド(Kool-Aid)&quot; を飲む (スクラムを全面的に信頼する) 前に，スクラムをあたかも万能の解決策のように盲信していないか，確認する必要がある，と結論付けている：</p> 
  <blockquote> 
   <p>スクラムが重要なムーブメントであり，すべてのエンジニアリングチームの生産性にプラスの影響を持っていることには，疑いの余地はありません。それでもスクラムは単なる開発方法論に過ぎないのです。価値ある企業を構築するための，あるいは優れたプロダクトを提供するための万能薬ではありません。プロダクト提供に関して言えば，スクラムがカバーする領域はその33%に過ぎないのです。</p> 
   <p>スクラムは企業や世界を救ってはくれません。玄関をノックする音には注意してください。やって来たのは狂信者かも知れません。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>