<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>プロジェクトはすべてやめるべきか？</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/11/get-rid-of-projects"><em>原文(投稿日：2013/11/30)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>Paul Kuijten氏は，<a href="http://www.xpdays.net/">XP Days Benelux 2013カンファレンス</a>で行った&quot;<a href="http://www.xpdays.net/Xpday2013/XPDays/Program.html#session_178">kill all projects</a>&quot;というセッションの中で，すべてのプロジェクトを一掃してはどうか，という問題提起を行った。InfoQでは氏にインタビューして，アジャイルにとって有益なプロジェクト管理の実践，および製品開発資金に関する話を聞いた。</p> 
  <p><strong>InfoQ: XP Daysでのセッションは &quot;Kill all projects (プロジェクトを全廃せよ)&quot; というタイトルでしたが，</strong><strong>過激ではないでしょうか？</strong></p> 
  <blockquote> 
   <p><strong>Paul:</strong> そうは思いません。 今までとは違った考え方を引き出したかったのです。複雑な環境の中で行う製品開発において，&quot;プロジェクトを行う&quot;ことが本当に適切なのか。何か他の方法で利益を維持し，欠陥を取り除くことはできないのか。今回のセッションでは，そのようなことを明確にしたいと思っていました。</p> 
  </blockquote> 
  <p><strong>InfoQ: プロジェクトを止めてしまうというのは，それはつまり，プロジェクト管理も不要ということなのでしょうか？</strong></p> 
  <blockquote> 
   <p><strong>Paul: </strong>そのとおりです。実際に私は今，非常に大きな組織で仕事をしているのですが，そこではプロジェクトマネージャという肩書きは廃止されています。チームがあって，製品があって，それらが直接，ビジネス上のニーズによって動いているのです。それでは，プロジェクトマネージャと呼ばれていた人たちの持っているスキルは，もはや企業の必要とするものではないのかというと，そういう訳ではありません。その人たちは基本的に，自身のスキルセットに見合った役割に移っていけばよいのです。</p> 
  </blockquote> 
  <p><strong>InfoQ: アジャイルチームにとって価値のあるプロジェクト管理のグッドプラクティスとは，どのようなものなのでしょう？</strong></p> 
  <blockquote> 
   <p><strong>Paul:</strong> 目的や方法，資金，タイムラインなどの管理が非常に重要であることは，アジャイルでも変わりありません。いわゆるプロジェクトマネージメントには，グッドプラクティスと呼ばれるものは山ほどあります。それらのほとんどは，プロジェクトなしで製品開発を行った場合でも，十分に応用可能です。私たちが本当に排除したいのは，予測や指揮統制管理の誤った運用に関するプラクティスなのです。これらは “プロジェクトを行う” という行為と，極めて強く結びついていることが分かっています。その上，私たちが経験してきたプロジェクト組織は，人や品質，価値といった，本当に必要なものへの考慮が十分ではありません。そういった意味から私は，&quot;プロジェクトを行う&quot;ことなく開発を実施する方法について，考える価値があると思うのです。</p> 
  </blockquote> 
  <p><strong>InfoQ: プロジェクトを廃止してしまったとしたら，製品開発の資金はどうやって確保するのでしょうか？</strong></p> 
  <blockquote> 
   <p><strong>Paul: </strong>組織から製品開発の資金を獲得する場合，予算請求を行うのが一般的です。ですが予算というのは，およそ考えられる中で，もっともくだらない仕組みです。予算を立てたが最後，１年前には予想もしなかったことに縛り付けられる１年サイクルから逃れらなくなります。それのどこがアジャイルなのですか？ その上，年末になって要求した予算額が必要でなかったならば，何とかしてそれを消化しようとします。そうしないと，翌年の予算が削られるからです。最近では多くの企業が，反復的あるいは段階的な方法で開発資金を提供するようになっています。そこでは自らのメリットを基準として，すべての投資が判断されています。そのもっとも顕著な例が，&quot;脱予算(beyond budgeting)&quot; と呼ばれるものです。いろいろな意味でこれは &quot;会計管理のアジャイル&quot; といえます。Svenka Handelsbanken(スウェーデンの銀行)ではこの手法を長年続けていて，驚異的な成果を上げているのです。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>