<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>リーンスタートアップが投資家と付き合うには</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/03/investors-lean-startup"><em>原文(投稿日：2014/03/13)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>リーンスタートアップを採用する起業家たちも，ビジネス資金の調達に投資家の協力を得ることがある。しかしリーンスタートアップで起業するビジネスプランには，従来の起業スタイルとは異なる部分が多い。また，失敗から学ぶ，ピボット(pivot, 路線変更)する，といった行動を重視するリーンスタートアップは，投資家から敬遠される可能性もある。起業家と投資家が一緒になって，資金調達にリーンスタートアップアプローチを使うことはできるのだろうか？</p> 
  <p>Jake Spertus氏は&quot;<a href="http://blog.istart.org/2013/08/02/can-lean-startups-compete-in-business-plan-competitions/">Can Lean Startups Compete in Business Plan Competitions</a>&quot;というブログ記事で，リーンスタートアップのビジネスプランを取り上げている。その中で氏は，リーンスタートアップと従来型スタートアップとの違いを次のように説明する。</p> 
  <blockquote> 
   <p>リーンスタートアップは，長期的で具体的なビジネスプランではなく，全体的なビジョンとテストすべき一連の仮説とを計画的に配置した，適応力の高いビジネスモデルを採用しています。このようなビジネスモデルが，スタートアップ時の戦略が機能しない場合の”ピボット”を可能にしています。ユーザからのフィードバックに基づいて製品を継続的に変更し，改良するのです。不確実性を予見してアジャイルに留まることで，最終的な成功のチャンスを最大化しようとするのがリーンスタートアップなのです。</p> 
  </blockquote> 
  <p>氏の言うように，リーンスタートアップを採用する起業家に対しては，ビジネス提案の評価や投資決定の方法を変える必要があるだろう。</p> 
  <blockquote> 
   <p>方法論としてのリーンスタートアップには，コスト予測やビジネスプランの確立性といった従来の指標を重視しない傾向があります。ビジネスコンペではビジネスプランに完全性を求めることが多いのですが，リーンスタートアップに効率的な対応をするための発展も必要でしょう。</p> 
  </blockquote> 
  <p>ここで氏は，Kauffman財団の上級研究員であるDiana Kander氏の言葉を引用している – &quot;まだ立証されていないビジネスプランを持ったスタートアップにあえて賭けますか，それともすでに世に出て，現実的な成果を上げている製品を作る企業を選ぶのですか？&quot; ビジネスの競争において，リーンスタートアップアプローチを採用する企業にチャンスが多い理由について，氏は次のように説明する。</p> 
  <blockquote> 
   <p>ある製品を発想し，ユーザと一緒に評価して，ビジネスプランを作り上げてしまえば，ビジネスプランの競争力という面でリーンスタートアップが従来型のスタートアップに見劣りする，ということはないはずです。ビジネスプランコンペという形態が，リーンスタートアップでは従来型のスタートアップと競えないほど問題のある訳ではありません。ですが，コンペに向けてビジネスプランを立案するという行為を完遂するには，ひとつのソリューションに対して相当な時間とエネルギを投資するという，リーンアプローチに反した行動が必要なのです。このような理由から，現在人気の高まっているビジネスモデルコンペの方が，リーンスタートアップにはフィットすると思います。</p> 
  </blockquote> 
  <p>Ben Yoskovitz氏は&quot;<a href="http://www.instigatorblog.com/lean-startup-versus-raising-capital/2013/06/24/">Lean Startup Versus Raising Capital</a>&quot;というタイトルで，リーンスタートアップアプローチで資金調達する起業家と投資家のニーズについてブログ記事を書いている。最初に言及しているのは，リーンスタートアップとの投資の違いについてだ。</p> 
  <blockquote> 
   <p>リーンスタートアップは実験と学習です。(...) それに対して投資が扱うのは，ストーリ作りであり，大きなビジョンです。さらには証明であり，急上昇を生み出す牽引力です。</p> 
  </blockquote> 
  <p>起業家にとって重要なのは，ストーリとビジョンを戦略や戦術と組み合わせることだ，と氏は言う。</p> 
  <blockquote> 
   <p>投資家の&quot;琴線&quot;に触れるような魅力的なストーリを語れなければ，彼らの注意を引くことはできません。生まれ持ったストーリテラーだという創業者は多くなくても，積極的に取り組むことが大きな違いを生み出します。素晴らしいストーリを描き，感情を込めたビジョンを示してこそ，投資家を呼び込むチャンスがあるのです。</p> 
   <p>(...) 戦略および戦術の詳細にまで立ち入って，投資家に対して，自身のビジョンをいかに積極的<em>かつ</em>理性的に実行するかを示さなければなりません。そこにリーンが必要なのです。戦略および戦術としてのリーンスタートアップ， リーンアナリティクスが，実践的なガイドブックの役目を果たしてくれます。</p> 
  </blockquote> 
  <p>Cameron Chell氏は<a href="http://cameronchell.com/fundamental-activity-step-1/">リーンスタートアップを対象とした投資活動の基本</a>を，&quot;繁栄，認識，理解を創造し，リーンスタートアップ方法論のサポートを目的としてスタートアップに投資すること&quot;だという。</p> 
  <blockquote> 
   <p>効果的な投資を行うためには，リーンスタートアップの方法論を理解する必要があります。理由は単純で，成功を図る基準が従来のスタートアップとは異なるからです。リーンスタートアップが重視するのは顧客の利益，証拠であり，必要ならば行う敏速なピボットなのです。</p> 
  </blockquote> 
  <p>リーンスタートアップは早期かつ頻繁に失敗から学ぶのだから，リーンスタートアップで仕事する投資家はそれに慣れなければならない，と氏は説明する。</p> 
  <blockquote> 
   <p>投資家は慣習的にミスを受け入れません。失敗に向かうステップだと見ているのです。しかしリーンスタートアップでの失敗は，それが実行可能な選択肢ではない，という意味に過ぎません。ごく当たり前のことなのです。リーンスタートアップに失敗は付きものですが，早い段階でスマートに失敗します。そして製品の提供を繰り返します。そうやってコースを変更しながら，自分たちの顧客層から最大の共感を得られるような製品の提供に近付いていくのです。このプロセスが現実世界におけるテストと学習であり，プロジェクトを成功に導くステップであると理解するのが，リーンスタートアップ投資家なのです。</p> 
  </blockquote> 
  <p>Gaurav Jain氏はVentureBeatへのゲスト記事で，<a href="http://venturebeat.com/2014/01/08/why-is-your-fundraising-process-waterfall-when-your-startup-is-lean/">スタートアップが&quot;リーン&quot;でありながら，資金調達プロセスが&quot;ウォーターフォール&quot;である理由</a>について書いている。記事の最初は，投資家にアピールするために起業家が使用している従来型アプローチについての説明だ。</p> 
  <blockquote> 
   <p>ところがベンチャ資金の調達となると，驚いたことにほとんどの起業家が，依然として&quot;ウォーターフォールモデル&quot;に従っているのです。典型的なプロセスは次のようなステップです。資金の必要性を実感する→プレゼン資料にまとめ上げる→たくさんのVCに送る→多数のミーティングをセットアップする→早く結果が出ることを願う。</p> 
  </blockquote> 
  <p>ブログ記事では，リーンスタートアップの原則を資金調達プロセスに適用する方法についても説明されている。</p> 
  <blockquote> 
   <p>1.構築(Build)-計測(Measure)-学習(Learn)。 あなたのピッチが製品であり，市場における潜在的な投資家の存在なのです。</p> 
   <p>2. 仮説の重視。(...) 投資家が&quot;価値&quot;を見出しているかどうかは，それに投資している時間の長さを見れば一目瞭然です。</p> 
   <p>3.スモールバッチの原理。(...) 実施項目のリストを小さなバッチに分割するとよいでしょう。最も建設的なフィードバックを得られそうなものを投資家とともに選択して，それを最初に実行するのです。</p> 
   <p>4.有益な知識。(…) ピッチの中で多くのダイヤルやノブを理解し，いろいろなバージョンをテストし，どれが最善であるかを見つけ出すことが起業家にとって重要です。</p> 
   <p>5.コーホート(Cohort)分析。 問題の早期把握に加えて，ピッチミーティングを小さなバッチやコーホート(共通集団)に分割することで，ピッチに対して実施した変更が成功にどのような影響を与えるかを分析し，理解することが容易になります。</p> 
  </blockquote> 
  <p>リーンスタートアップの原則を資金調達活動に適用するメリットについて，氏は次のように述べている。</p> 
  <blockquote> 
   <p>リーンスタートアップモデルの核心は，間違ったことを必要以上に長く続けるという無駄を省く，という点にあります。20以上のVCピッチを通過してきた起業家が，その時点になって初めて，もっと早く取り組んでおかなければならなかった根本的な問題に気付くというのは，悲劇という他ありません。</p> 
   <p>貴重な時間とリソースをピッチミーティングで浪費することは止めて，すべての関係者，特に起業家にとって，もっと生産的な活動に費やすようにするべきです。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>