<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>即興的な劇場型ワークショップで言葉の壁を経験する</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/12/improvisational-theatre-workshop"><em>原文(投稿日：2013/12/03)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>XP Daysに行われた<a href="http://prezi.com/wd9m3sasz19n/agile-cross-borders/">Agile Cross Borders</a>ワークショップでHoang-Anh PHAN氏とAnais Victor氏は，多文化組織(multi cultural organization)における言葉の壁への対処方法を検討した。両氏はベトナムの企業であるOfficienceに所属する。フランスのユーザを対象としたアウトソーシングサービスを提供している同社では，コミュニケーションや共同作業には英語を使用している。</p> 
  <p>ワークショップでは全体を複数のチームに分けて，模擬的な３回の改善イテレーションを行うゲームを実施した。最初のイテレーションで各チームに要求されたのは，例えば”駅で荷物を取り違えた２人&quot;というように，ある状況を持ったシーンを想定することだった。チームメンバはそれぞれの役割を話し合い，その状況とそこで使用するテキスト行を繰り返し，改善方法についての振り返りを行った。</p> 
  <p>第２のイテレーションではひとつの制約が追加された。チームの各メンバが１つないし複数の書かれたノートを受け取り，それ以外の言葉を使わないように指示されたのだ。チームはこの制限のもとで，先程と同じ状況を演じる方法を議論し，練習した。</p> 
  <p>第３イテレーションでは第２のイテレーションで指示された同じ言葉を使って，新たな状況を演じるように指示された。チームには改善を検討するための時間として，15秒間のみ与えられた。他のチームには観客として，そのチームが演じている状況を理解するように要求された。</p> 
  <p>即興のワークショップを行った後に両氏は，３つのイテレーションをどのように感じたか，課された制約にどう適用したかを各チームに質問した。チームの返答は，第２のイタレーションで使用する言葉を制限されたことが大きな障害だ，というものだった。彼らはボディランゲージやサインなどを使って，自分自身を表現してコミュニケーションを構築するための別の手段を模索していた。第３のイテレーションでは準備時間が非常に限定されたため，チームはストーリ上で重要な役目をシンプルに演じることに集中した。この第３のシーンを演じることでチームのメンバは，言葉の制限によるストレスが，観衆に状況を説明する上での真の障壁であることを感じ取ったようだ。</p> 
  <p>英語を母国語としない人々にとって，お互いに英語でコミュニケーションするのは難しい場合がある。ユーザと話すことに不便を感じたり，自分たちを説明するための適当な言葉を探すのを難しく思うこともあるだろう。チームに一定の仕組みを用意することがその支援になるかも知れない，と両氏は言う。例えばスタンドアップミーティングでは一般的に，昨日行ったこと，今日行うこと，問題点を報告するという一定の構造がある。その他に氏らが使用している仕組みとしては，問題報告やリリースを解説するための電子メールのテンプレートがある。テンプレートは分かりやすい言葉を使って，利用者にとって使いやすいものになっている。</p> 
  <p>ユーザに問い合わせる必要のある場合は，話したい内容を書き留めるためのスクリプトを利用している。最初はメッセージの内容が理解できるものかを確認するために，これらのスクリプトを読むことから始めればよいだろう。両氏はさらに，チーム内のメンバ間あるいはユーザとのコミュニケーションに複数の手段があることを参加チームに認識させると同時に，与えられた状況においてより快適なコミュニケーションを行う方法をチームが見出せるよう，彼らをサポートした。</p> 
  <p>不快に感じれば，人々はあまり会話しなくなってしまう。快適になると，会話が多くなり過ぎるかも知れない。話すこと，黙って聞いて理解すること。この２つのバランスが取れるように支援する必要がある，と両氏は述べている。</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>