<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>QConTokyo2013【アジャイル/モデリング】トラックのご紹介</h3><h2>QConTokyo2013【アジャイル/モデリング】トラックのご紹介</h2> 
<p>ようやくドメイン駆動開発DDDも現実味を帯びてきました。業務や問題領域の中核的なしくみをドメインモデルとして定式化し、それをコアにしてシステム全体のアーキテクチャを段階的に構築していく考え方です。ここでは、モデリング技術とアーキテクチャ設計技術とアジャイルに開発プロセスを進めていくマネジメント技術が有効にチーム内外で働く必要があります。</p> 
<p>考え方も実践する際の注意点も共有できていません。このトラックでは、アジャイル開発プロセスの観点から、コーディングスタイル、モデリング、NOSQLデータベースによる柔軟なシステム実現、という３つのテーマでアジャイルとモデリングの最新状況をご紹介したいと思います。</p> 
<p>１つめは、有限会社システム設計の増田 亨さんより、『小さなオブジェクトでドメインモデルを組み立てる－ドメイン駆動設計の実践ガイド－』を話していただきます。１つだけの明確な責務をもった管理単位としての小オブジェクトの有機的な組合せが信頼性の高い保守しやすい柔軟なシステムを構成する際の一番重要なポイントだとわかります。それを実現するための具体的な養成ギブスの在り方についても学ぶことができるでしょう。</p> 
<p>２つめは、株式会社アットウェアの北野さん・河村さんより、『(仮）アジャイル開発とNoSQLは相性がいい』と題して、オープンソースのNoSQLデータベースとして現在注目されているCouchBaseを使った実践的なアジャイル開発を進める際の注意点を解説していただきます。CouchBase自体も、ドキュメントDBとしての要素と高機能分散DBとしての要素を併せ持ち管理機能がかなり使いやすいとのことですので、今後のシステム開発で利用するDBの候補としてウォッチしたいところです。</p> 
<p>３つめは、株式会社アトラクタの原田騎郎さんより、『(仮)アジャイルにおけるモデリングの意味と実践』と題して、アジャイル開発の現場でDDDを実践する際のモデリングの原理・方法論的な話と具体的な適用事例を交えた実践ノウハウの話をしていただく予定です。</p> 
<p>ぜひ、みなさまのニーズを満たす実践的なノウハウをいくつか持ち帰っていただけるよう理論と実践の両方で工夫した企画をご提供しようと考えております。最後の懇親の場であるビアパーティ等で皆様とアジャイルやモデリング、DDDの苦労について楽しく語り合うことができることを期待しております。</p> 
<h2>●開催概要</h2> 
<p>開催日時：2013年4月23日(火) 10:00-19:00 (19:00～ ビアパーティあり)<br /> <br /> 会　　場：JA共済ビル カンファレンスホール<br /> <br /> 公式サイト：<a target="_blank" href="http://qcontokyo.com/">http://qcontokyo.com/</a><br /> &nbsp;</p> 
<p>&nbsp;</p> 
<p id="lastElm"></p><br><br><br><br><br><br></body></html>