<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>QConTokyo2013【モバイル/HTML】トラックのご紹介</h3><h2>QConTokyo2013【モバイル/HTML】トラックのご紹介</h2> 
<p>ブラウザから利用出来るWebアプリケーションが誕生した後、Webアプリケーションはそれまでのクライアントサーバシステムに少しづつ置き換わり、現在では様々な情報システムの利用シーンでなくてはならない基盤技術の一つになりました。</p> 
<p>昨今のWebアプリケーションは様々に形を変化させながら大きく変貌を遂げつつあります。 <br /> モバイル／HTML5トラックでは、急速に普及しているスマートフォン そして タブレットへの対応を取り上げ、マルチスクリーンで利用者に魅力的なUXを提供するアプリケーションを開発するするために不可欠な知識と技術の習得をテーマして構成しています。</p> 
<p>&nbsp;</p> 
<p>1つ目のテーマは、「<strong>HTML5と情報表現の最適化</strong>」です。 <br /> 最近のブラウザベースのアプリケーション開発シーンでは、PC、スマートフォンのみならず、タブレットやWebTVといった異なる画面フォーマットを持つ複数の機器の利用者に対して適切な「情報表現」を実現することを求められてい<br /> ます。</p> 
<p>従来、こうした「情報表現」はWebデザイナの仕事ですが、HTML5の導入によってWebデザイナとWeb開発者の役割がより近くより緊密になりつつあります。これは、Webデザイナがこれまで以上に情報処理技術を知らなければならなくなったという側面と、Web開発者が「情報表現」についての高い知識とセンスを求められるようになった側面があり<br /> ます。</p> 
<p>最近、様々な出力デバイスに対応したUIをワンソースで実現する「リスポンシブルWebデザイン」の必要性が高まっています。リスポンシブルWebデザインを実現するために我々開発者は、開発技術の知識／経験のみならず、「情報表現」技術の習得が不可欠だと言えます。「情報表現」技術とは、デバイスや利用者／利用シーン毎に表示すべき情報を取捨選択し、最適なデザインで表現するための技術です。</p> 
<p>この講演では、HTML5を使った情報表現の在り方について整理してみたいと考えています。情報アーキテクチャ（Information Architechture）やセマンティクスについて言及し、利用者にとって最適なアプリケーションでの情報表現について考えます。</p> 
<p>&nbsp;</p> 
<p>2つ目のテーマは、「<strong>WebRTCで変わるWebの未来</strong>」です。 <br /> テーマの通り、ブラウザベースのアプリケーションのこれからの未来を垣間見る講演になる予定です。 <br /> WebRTCは、ブラウザ上でリアルタイムコミュニケーションを実現するためのフレームワークです。 <br /> これまでも、CometやWeb SocketなどのようなリアルタイムWebを実現するための仕組みはありましたが、オーバーヘッドが大きかったり、双方向コミュニケーションには不適切だったりといった課題がありました。 <br /> WebRTCを組み込むと、ブラウザ間での双方向コミュニケーションを実現することが出来ます。そして、WebRTCは、これを実現するためにP2Pによる通信や端末内のローカルデバイス制御（カメラ、マイク等）など、これまでのブラウザベース アプリケーションでは比較的難しいとされた技術を集結させています。</p> 
<p>受講いただいたみなさんは、WebRTCの解説を通じて、ブラウザベース アプリケーションのこれからの可能性や未来を垣間見ることができると思います。 <br /> また、お聞きになる方がこの講演を通じて、次世代のブラウザベースアプリケーションについてインスピレーションを得られるようであれば、幸いです。</p> 
<p>&nbsp;</p> 
<p>3つ目のテーマは、「<strong>HTML5</strong><strong>で出来る多彩なビジュアリゼーション</strong>」です。 <br /> 筆者は、HTML5とCSS3に関する様々な著書を共同執筆しています。 <br /> HTML5は、CSS3、SVG、Canvs、WebGLなどの非常に強力なツールを提供しています。この講演では、HTML5で利用できるこうしたツールの特徴と、それらを使ってどのようなUI／UXを実現できるのか、を解説します。</p> 
<p>また、Rapha&euml;l, Processing.js, D3.js, Fabric.jsといった魅力的なビジュアライゼーションの実現を強化にサポートしてくれるフレームワークを取り上げ、HTML5プラットフォームにおけるビジュアライゼーションの「今」を体験することが出来ます。</p> 
<p>&nbsp;</p> 
<p>このように、QCon Tokyo 2013 モバイルトラックは、</p> 
<p>①利用者に最適な「情報表現」を実現 <br /> ②これからのモバイルアプリケーションの未来を体験 <br /> ③HTML5プラットフォームに可能なビジュアライゼーションの「今」を体験</p> 
<p>の3部構成でお届けする予定ですので、ご興味のある方は是非ご参加下さい。</p> 
<h2>●開催概要</h2> 
<p>開催日時：2013年4月23日(火) 10:00-19:00 (19:00～ ビアパーティあり)<br /> <br /> 会　　場：JA共済ビル カンファレンスホール<br /> <br /> 公式サイト：<a target="_blank" href="http://qcontokyo.com/">http://qcontokyo.com/</a></p> 
<p id="lastElm"></p><br><br><br><br><br><br></body></html>