<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイルプロジェクトのためのガバナンス</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/05/governance-agile-projects"><em>原文(投稿日：2014/05/12)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p><a href="http://conferences.unicom.co.uk/agile-governance/">アジャイルガバナンスカンファレンス</a>は、ガバナンスをこう定義した。</p> 
  <blockquote> 
   <p>価値を創造するために戦略（プロジェクトやプログラム、プロダクト開発）を組織的目標に協調させること。ガバナンスは、どのように戦略を打ち立て、管理し、制御するかを定義します。</p> 
  </blockquote> 
  <p>アムステルダムで5月13日に行われるアジャイルガバナンスカンファレンスでは、ソートリーダーや実践者たちが集まり、自己組織化されたチームやアジャイルプロジェクトがステークホルダーに価値を届ける際にガバナンスがどう役立つのかを示す予定だ。</p> 
  <p>Andrew Craddock氏はこのカンファレンスで、程よく管理されたアジャイルプロジェクトについての講演を行う。InfoQは、アジャイルガバナンスとは何か、またアジャイル開発プロセスにガバナンスプラクティスを組み込むことがなぜ必要とされるのかについてインタビューを行った。</p> 
  <p><strong>InfoQ: アジャイルガバナンスとは何か聞かせていただけますか？</strong></p> 
  <blockquote> 
   <p><strong>Andrew</strong>: 私にとってガバナンスとは2つあります。1つ目は、私たちが正しいプロジェクトを運営していることを保証するもの。正しいプロジェクトとは言い換えれば、出資しているビジネスのニーズときっちり連携していて、かつそのための正当な理由が存在するものです。2つ目は、プロジェクトが産み出すものが適用される法律や企業ポリシーに準拠していることを保証するもの。アジャイルガバナンスは、アジャイルなプロジェクトにおいてこれがどのように達成されるべきかというところに注目します。それも本当に効果があり、かつアジャイルな仕事のしかたに干渉しないやり方で、です。</p> 
  </blockquote> 
  <p><strong>InfoQ: なぜアジャイルガバナンスが重要になるのでしょう？ どんな利益がありますか？</strong></p> 
  <blockquote> 
   <p><strong>Andrew</strong>: ガバナンスが重要、場合によっては必要不可欠だということを認め、かつまたアジャイルな仕事のしかたを望むのであれば、ガバナンスをアジャイルな仕事のしかたと合わせることが必須になります。ほとんどの企業においては、ガバナンスの習慣や慣行は伝統的な「ウォーターフォール型」の開発スタイルが前提になっていて、ガバナンスを文書による成果物と合わせることでそのやり方をサポートしています。実際のところ、これはたいてい非アジャイルプロジェクトにおいて部分的に効果があるだけで、根本的にアジャイルの価値観とは相容れないものです。アジャイルガバナンスでは、官僚的なハードルを乗り越えるときのエクササイズとしての存在から、真に価値あるものをタイムリーかつインクリメンタルにビジネスに提供することでプロジェクトをさらに成功させるものへと、焦点を移すことができます。</p> 
  </blockquote> 
  <p><strong>InfoQ: アジャイルプロジェクトをうまくいかせるためのガバナンスプラクティスをいくつか教えてください。</strong></p> 
  <blockquote> 
   <p><strong>Andrew</strong>: 一般的なプロジェクトガバナンス、つまりプロジェクトがROIの面で実行可能（であり続ける）かどうかに関わるものですが、これについて言えば、認証・継続モニタリングを、ムダなドキュメンテーションを可能な限りしないというアジャイルな価値観や、要求の詳細と解決方法は時がたてば出現するのだという考え方と結びつけることが大切です。DSDMはこのための優れたフレームワークを提供するもので、5月13日のアジャイルガバナンスカンファレンスの講演では少しこれについて触れます。</p> 
   <p>規制基準やその他の基準に関連するガバナンスについて言えば、開発チームがやっていること、やっている時に直結させることが重要です。言い換えれば、コンプライアンスへの準拠を反復型開発プロセスの一部にしてしまうのです。</p> 
  </blockquote> 
  <p><strong>InfoQ: 企業がアジャイルガバナンスを実施するための方法をいくつか詳しく教えてください。</strong></p> 
  <blockquote> 
   <p><strong>Andrew</strong>: アジャイルガバナンスが従来のガバナンスと大きく違う点は、アジャイルマニフェストに書かれたバリューステートメントに沿っていることです。アジャイルガバナンスはアジャイルマニフェストに寄っているべきです。つまり、プロセスやツールよりも個人と対話を、包括的なドキュメントよりも動作するソリューション（単なるソフトウェアだけでなく）を、契約交渉よりも顧客との協調を、計画に従うことよりも変化への対応を。</p> 
  </blockquote> 
  <p><strong>InfoQ: 社内のプロジェクトがアジャイルマニフェストを順守するように、しかもそれをお役所的にではなく統制するためには、どうしたらいいですか？</strong></p> 
  <blockquote> 
   <p><strong>Andrew</strong>: 私は十数年前だったか、<a href="http://www.infoq.com/author/Jim-Highsmith">Jim Highsmith氏</a>のプレゼンテーションを見たのですが、彼の話の中で私が深く心に刻んだ2つのことがあります。1つ目は「ドキュメンテーション」は「理解すること」とは別物だということ、2つ目は「形式的であること」は「規律」とは別物だということです。ここ数年で私自身が加えた3つ目があります。3つ目は「お役所仕事」は「品質」とは別物だということです。あなたが言うような企業は、この3つをちゃんと理解する必要があります。お役所仕事をしておけば安心だという誤解を捨て去り、プロジェクトやそれに伴う課題に対する当事者意識を持つようになる必要があるのです。13日の講演では、そんな未知のものに恐ろしい大ジャンプをしてまで飛び込まずともこれを達成する方法について説明できるといいのですが。</p> 
  </blockquote> 
  <p><strong>InfoQ: アジャイルであるよりもアジャイルをやりたい、という人もいるようですね。それについてはどうお考えですか？ ガバナンスはアジャイルである方、やる方、どちらの話に近いですか？ それとも両方ですか？</strong></p> 
  <blockquote> 
   <p><strong>Andrew: </strong>正直なところ、ガバナンスの慣習やプラクティスと仕事のしかたが足並みを揃えていなければ、効果的に「アジャイルをやる」ことはできないと思います。「アジャイルをやる」ことのできるプロジェクトチームもいるかもしれません。それでも、やろうと（もしくはやっているんだと）提案していることがビジネスに有益であるとか、作っているプロダクトが各種規約や企業が独自に定める基準に準拠しているのだということを証明してみせるのには四苦八苦することでしょう。「アジャイルである」というのは、ソフトウェア構築にまつわる詳細な技法では解決できない問題を、個々のプロジェクトの垣根を越えて、広くビジネスの文脈でアジャイルな考え方を活用できているような世界に持ち込めることです。「アジャイルをやる」というのは「アジャイルである」ようになるための第一段階としては良いかもしれませんが、ただの初めの一歩に過ぎません。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>