<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>モダナイゼーションは避けがたい道</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/12/modernization-is-not-optional"><em>原文(投稿日：2013/12/10)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>世界<a href="http://www.accuity.com/useful-links/bank-rankings/">10大銀行</a>のひとつであるRoyal Bank of Scotlandが先日，18ヶ月に及ぶ <a href="http://www.ft.com/cms/s/0/05cf8cce-5c43-11e3-931e-00144feabdc0.html#axzz2n1p4L5xx">３度目のITシステム障害</a> に見舞われた。同行CEOは &quot;RBSが数十年間に渡って，システムに適切な投資を行っていなかった&quot; ことを認めている。 この事件を契機としてコンサルティング会社<a href="http://everware-cbdi.com/">Everware-CBDI</a>の創業者でCEOであるDavid Sprott氏は，銀行業界に特有と思われる <a href="http://davidsprottsblog.blogspot.com.au/2013/12/systems-failure-at-rbs-again.html">システムのモダナイゼーション(modernization, 近代化) の無視</a> についての記事を執筆した。</p> 
  <p>根本的な問題として氏が記しているのは，銀行の数の多さとその規模の大きさだ:</p> 
  <blockquote>
   “ ... そのためシステムは，アーキテクチャやガバナンスを改良することなく，生きながらえることができたのです。[レガシ]システムは，粘着テープやシーリングワックス(訳注: 封書などを閉じるための蝋)などと同じで，新たな要求に合わせて少しずつ修正されてきました。新しいシステムにはインターフェースや (重複やハードコードされたビジネスルールのような) 依存性を持った実装が次々と作り込まれて，今では毛糸玉のようになっています。&quot;
  </blockquote> 
  <p>その結果として，システムに関するノウハウや資料，あるいはコードの不足のために，実装全体を完全に理解できないままにプロセスやソフトウェア，実行環境の変更が実施される時，複雑性とリスクの増大という問題が顕在化する。</p> 
  <p>氏は，“モダナイゼーション” というものが単なる新プラットフォームへのアプリケーション移行であると誤解されていて，それよりも重要なアーキテクチャ上あるいは組織上の問題が理解されていないのではないか，という懸念を抱いている。そうではない，モダナイゼーションとはもっと広範なものだ，と氏は主張する:</p> 
  <blockquote> 
   <ol> 
    <li>ビジネスとIT管理者の双方がモダナイゼーションの問題と影響を本当に理解するための共通語 (Lingua Franca) の確立。</li> 
    <li>a)&nbsp;低リスクな変換を促進し，b)&nbsp;継続的に進化する本来のアジャイルアーキテクチャを漸進的に開発するための，ビジネスシステムアーキテクチャの定義。</li> 
    <li>アーキテクチャの要請に従いながら，企業におけるビジネスシステムのポートフォリオを段階的に合理化するためのロードマップ。</li> 
    <li>ビジネスシステムを所有するIT組織とビジネスとの統合の実現。</li> 
    <li>プロセスと情報，およびルールの整合性と一貫性，所有権を確保するための，ビジネスシステムに関するナレッジマネジメントの実践。</li> 
    <li>継続的なアジャイルのモダナイゼーションと，ビジネスおよびIT両面での絶え間ない進化プロセスの実現。</li> 
    <li>システムライフサイクルのすべてのステージにおけるアーキテクチャの整合性を確保するための，コーディネーションとガバナンス，リスクマネジメントの確立。</li> 
   </ol> 
  </blockquote> 
  <p>氏は上記のリストについて，この問題がIT部門に限られたものではなく，マネジメント全般の問題であって，ビジネスマネジメントとITが効率的に共同作業を行うことで初めて対応可能なものだ，と指摘している。さらに氏はこれらの問題について，大規模な組織では普遍的に見られるものであることを指摘するとともに，読者に対して &quot;モダナイゼーションは避けられない道&quot; というメッセージを送ることで記事を結んでいる。</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>