<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイルのガバナンスにおけるマネジメントの役割</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/05/management-agile-governance"><em>原文(投稿日：2014/05/20)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>複数のアジャイルチームを管理するにはどうすればいいだろうか。<a href="http://conferences.unicom.co.uk/agile-governance/">アムステルダムで開催されたAgile Governanceカンファレンス</a>でChristoph Johann Stettina氏がアジャイルのガバナンスとマネジメントの役割について発表した。氏はヨーロッパの14の大企業がどのようにアジャイルプロジェクト管理の手法をITプロジェクトに導入しているかを研究した。氏の研究結果は<a href="http://www.sciencedirect.com/science/article/pii/S0263786314000489">Agile portfolio management: An empirical perspective on the practice in use</a>というレポートにまとめられている。</p> 
  <p>Christoph氏によれば、アジャイルの手法は、複数のソフトウエアプロジェクトを組織化する方法に静かな革命を起こした。アジャイルは‘新しい標準’となり、複数プロジェクトのマネジメントは個々のチームを超えてアジャイルを実践する機会になっている。</p> 
  <p>氏はアジャイルのカバナンスが従来の管理理論の前提を如何にして衝突したかを説明する。従来の管理手法は以下のような前提を持っていた。</p> 
  <blockquote> 
   <ul> 
    <li>プロジェクトの道筋と結果を完全に予想できる。</li> 
    <li>常にひとつのクライアントだけ。</li> 
    <li>命令と制御に注力。</li> 
    <li>内容には踏み込まない。</li> 
    <li>インプットと結果だけマネジメントする。</li> 
   </ul> 
  </blockquote> 
  <p>氏は自身の研究結果を以下のように説明した。</p> 
  <blockquote> 
   <p>アジャイルがプロジェクトのポートフォリオに組み込まれると、従来の考え方と衝突します。Prince-2のような従来の手法は予測的ですが、一方でアジャイルは適応的です。緊急発進ができ、反復的で探索的です。アジャイルチームは自己管理を実行し、事前に定義されたインプットとアウトプットだけに支配されません。イノベーションはどこでも発現します。プロジェクトの道筋も変わります。アジャイルチームは従来のプロジェクト管理のタスクを引き継ぎ、より効率的になるためにはある程度の自己管理を実施しなければなりません。</p> 
   <p>プロジェクトとチームの俊敏さはより素早い価値提供を可能にします。研究対象の企業ではよりマネジメントと密接に協力しようとしていました。安定したチームで働くことで競争力を得ようとしていたのです。アジャイルチームが2週間のスプリントで結果を出すことができるなら、4半期に一度プログラムとポートフォリオを調整するのでは不十分かもしれません。もっと頻繁に調整する必要がありそうです。</p> 
  </blockquote> 
  <p>マネジメントは文脈と内容を関連する領域を超えて絶えず支援し変換し続ける必要がある、とChristoph氏は言う。文脈と内容は絶えず変わっている。反復的なルーチンの中に変換作業を埋め込む必要がある。これを実現するためには、マネージャは情報が共有され理解されることを保証する必要があるのだ。氏は以下のように結論付ける。</p> 
  <blockquote> 
   <ul> 
    <li>アジャイルのマネジメントはセンスメイキングです。マネージャは文脈と行動を理解しなければなりません。</li> 
    <li>ルーチンはガバナンスの重要なツールです。どの手法を適用するか、どのように適用するかは状況に依存します。</li> 
    <li>アジャイルの実践はルーチンです。書籍を読んでも勉強できませんが、コーチングを利用することはできます。また、ゲームを使ってアジャイルの実践を学習することもできます。</li> 
    <li>学んだことをチーム間で共有するために振り返りが必要です。アジャイルは学習であり適応です。チームレベルで学んだことは積極的にチームを超えて共有する必要があります。</li> 
   </ul> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>