<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>カンバンで需要と能力のバランスをとる</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/12/demand-capability-kanban"><em>原文(投稿日：2013/12/16)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>カンバンを使うことで、組織は実施中の作業を把握し、需要と能力のバランスがとれるプルシステムを確立できる。まずは実際の能力がどの程度あるかを見極め、その能力の流れを可視化することだ。バランスがとれていなければ、組織は能力が需要に合うように行動する。</p> 
  <p>Florian Eisenberg氏は<a href="http://www.lkce13.com/">リーンとカンバンに関する中央ヨーロッパのカンファレンス</a>で<a href="http://www.lkce13.com/app/download/8243831495/Mon_Eisenberg_LKCE13.pdf?t=1384421729">Kanban: not &quot;yet another development process&quot;</a>というプレゼンをした。InfoQは氏にインタビューし、どのように需要と能力のバランスをとるかについて話を聞いた。</p> 
  <p><strong>InfoQ: Lean Kanban Central Europeカンファレンスで、あなたはカンバンを進化的な変更管理の方法だと言いました。詳しく教えてください。</strong></p> 
  <blockquote> 
   <p><strong>Florian: </strong>普通、変化は決まりきった最終状態とそこに向かう計画を伴って現れます。しかし、この方法は組織が複雑な環境に囲まれた複雑な適応的システムであり、人間である従業員を抱えているということを無視しています。この複雑さ故に環境全般のすべての情報(例えば行政の規制)を収集できません。また、競合の動きや顧客の動きについても同様です。Niels Bohrが言うように„予測は難しい。とくに将来の予測は!“。こう考えると、唯一の合理的な方法は進化的な方法で変化に対応することです。一歩ずつ着実に進んで、何が効果があり、何が効果がないのかを検証するやり方です。ただし、長期的な計画を立てられない、あるいは立てる必要がないということではありません。多くの仕事を放棄して変化する環境を利用するのなら別ですが。</p> 
   <p>アジェンダを念頭に置かずに、進化的に変化をするべきだということではないのです。進化的変化はカンバンの3つのアジェンダに到達するための手段なのです。3つのアジェンダとは、持続可能性、サービス指向、残存能力です。この3つのアジェンダがビジネスの機敏さを決めます。そして、この3つの中にビジネスの世界で機敏さを獲得するのに役に立つ適応条件があります。カンバンはこの適応条件に依存しますが、この条件について定期的に考える必要があるでしょう。ビジネスと環境が変われば、ビジネスに対するアプローチも変わりますし、適応条件も変わります。事前にこの変化がいつ起こるのはを知るすべはありませんので、変化を計画することはできません。事前にできるのはシステムレベルで弾力性を作り上げておくことであり、制約の変化に対して素早く反応できるようにしておくことです。カンバンを実践すれば、素早く、失敗しても安全なかたちで実験ができ、協同的にシステムを理解できます。また、異なるアプローチを試して、最も効果があったアプローチを採用することができます。これが進化的なアプローチなのです。</p> 
  </blockquote> 
  <p><strong>InfoQ: カンバンによって需要と能力のバランスをとることができるとおっしゃっていますね。バランスをとることがなぜ重要なのでしょうか。</strong></p> 
  <blockquote> 
   <p><strong>Florian: </strong>能力と需要の3つの状態について考えてみましょう。</p> 
   <p>まず、„能力が需要を上回っている“状態です。つまり、最小限の遅延で顧客の要望に答えることができる状態です。サービス側の視点から見れば、とても楽な状態でしょう。しかし、経済性の観点から言えば、能力の余剰に対してお金を使っているのかもしれません。顧客に余剰能力分も支払ってもらう必要があるかもしれません。</p> 
   <p>次は需要が能力を上回っている状態です。これは最初の状態の反対で、顧客がサービスを待っている状態です。顧客はことあるごとになぜサービスが提供されないのか尋ねてきます。経済性の観点から見れば、良好な状態です。すべてのリソースを活用できており、顧客からはさばききれない要望が来ています。より優れたサービスを求める顧客にはより高額な費用を要求して、その要望の優先順位を高くする必要があります。これは多くの組織がすでに行っていることです。しかし、この状態は顧客から見れば、良い状態ではありません。私が顧客だとすると、優先度の高い要望が私の要望の優先度を下げてしまうので、予測がつきません。また、追加の費用を払っていない状態だとサービス提供まで時間がかかり過ぎます。その結果、更なる要望をして、優れたサービスを求め、高い品質を求めます。そして、ゆっくりと確実に、顧客はほかのサービスを探し始めます。これは、サービスを提供する側にとっては圧力になります。いっそうの効率性を求め、より多くの要望を受けようとします。その結果、経済的観点からは良好だった状態が、そうではない状態になります。顧客が望むレベルでサービスを提供できる状態ではないからです。</p> 
   <p>最後の状態は需要と能力のバランスがとれている状態です。実施した作業は経済合理性のあるレベルでシステムに流れ込むものの、顧客が支払うべき余剰能力はありません。顧客、サービス提供側の双方にとって、このバランスがとれている状態がゴールです。</p> 
  </blockquote> 
  <p><strong>InfoQ: 需要超過だった場合、短期的には組織はどのような手を打てるのでしょうか。</strong></p> 
  <blockquote> 
   <p><strong>Florian: </strong>やるべきなのは本当の能力がどのくらいかを見極めることです。私が出会った多くのチームが自分たちの能力を把握できていませんでした。単に需要超過であるとしか認識していなかったのです。状況を嘆くだけでは改善されません。本当の能力がどれくらいかを見極め、交渉しタフな決定をするのです。もし、自分の基準を超えて働いていたとしても、こうすることで自分の望む状態になると期待してはなりません。むしろ、現実と向かい合うことになるのです。顧客とサービスレベル、能力、サービスレベル改善のためにできることについて話をするときです。すべてではなく、少数の価値あることについて話のです。</p> 
   <p>先日、私の同僚が客先に行きました。彼は何も書いていない付箋をバックログのアイテムに張り付けました。バックログのアイテムはそれぞれ、未完了、進行中、完了のステータスでした。こうして自分たちの仕事が可視化されると、チームは次のことに気付きました。つまり、問題は„すべてのバックログをどうやって1月31日までに終わらせるのか“ではなく、„遅れると一番コストがかかるアイテムはどれか“ということです。この問題が浮上したとき、チームは働き方を変え、すべてのアイテムを進行中にするのではなく、要望を整理するようになったのです。</p> 
   <p>つまり本当に重要なのは、能力がどのくらいあるのかをどうやって見積もるかです。私たちは、システムにどのくらいの労力がかかっているかを計測することで見積もりました。しかし、私たちはほぼ同時間帯で複数の作業が行われていることを明確にする必要がありました。また、正確に見積もり過ぎてしまうことを避けたかったので、見積もりはかなり概算になりました。„システムを同時に横切る“とは、私たちには作業を腐らせておくための無制限のバッファはないということを示しています。 無制限のバッファによってリードタイムは細かく分散してしまい、本当の能力がどのくらいあるのかを見極めるのが難しくなってしまいます。本当の能力を見極めることで、交渉によって需要を形成し始めることができます。</p> 
  </blockquote> 
  <p><strong>InfoQ: 能力をのばした組織やチームについて教えてください。どのようにのばしたのでしょうか。</strong></p> 
  <blockquote> 
   <p><strong>Florian: </strong>ほとんどの人が能力ののばし方を知っています。そして、ほとんどの人が実践したことがあります。新しく人を雇ったり、クロストレーニングスタッフの力によってです。とても難しいというわけではありません。単なる不可欠な投資です。よくないのは時間とお金がかかることです。経済的に厳しい状況なら、お金を使うのは最高のやり方ではありません。このような場合、私は投資をすることなく流動性を高める方法を採用します。あるプロジェクトを中止することで(お金はかかりますが)、短期的にテスターや開発者を追加するよりも短期的な流動性を確保できます。</p> 
  </blockquote> 
  <p><strong>InfoQ: 需要と能力のバランスについてもっと知りたいと思っているチームはどうすればいいのでしょうか。<br /> </strong></p> 
  <blockquote> 
   <p><strong>Florian: </strong>まず、私がはじめにすることは現状の作業量や利用しているサービス、チームや組織の市場での素早さに不満をいたいている人がいるかどうか調べることです。チームのパフォーマンスやコストにすべての人が満足しているなら、需要と能力にバランスには何の問題もありません。対処するべき不満がある場合は、現在実施中の作業とバックログを視覚化することで、次の一歩の見通しが明確になります。需要と現在の作業を目に見えるようにすることでチームやシステムに対する過負荷は明らかになります。そして、問題点が明らかになるので、„問題があるのか。どんな問題か“という問いは、„どのくらいの大きさの問題で、どんな方法で対処できるか“という問いに変わります。次の一歩はデータの分析です。要望、実施中の作業、実績を量と質の面から分析します。アイテムの種別を見て、顧客のエクスペリエンスについて話し、自分が再度実施するにはどのくらいかかるか、チームのメンバが実施する場合はどのくらいの作業量が妥当かを考えます。チーム、組織のほかの部門の関係者、顧客と一緒にこのデータを使って次の一歩を考えるのです。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>