<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイル適用の価値を評価する</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/03/measuring-value-agile"><em>原文(投稿日：2014/03/27)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>アジャイルを適用するビジネスケースを定義するとき，疑問に思うかも知れないのが，アジャイルソフトウェア開発の採用によって達成できるビジネスバリューをどうやって評価すればよいのか，ということだ。</p> 
  <p>&quot;<a href="http://blogs.versionone.com/agile_management/2014/02/19/agile-metrics-measuring-process-value/">Agile Metrics: Measuring Process Value</a>&quot;と題したブログ記事ではMichael Moore氏が，アジャイルのもたらす価値を測定することが重要な理由について説明している。</p> 
  <blockquote> 
   <p>(...) アジャイルは効率性だけではありません。有効性(価値の提供)もまた，アジャイルの目的なのです。突き詰めてしまえば，プロセスやメソッドとは，あなたの作業を迅速かつ安価にすることを支援するものです。でもそれでは，エンドユーザに提供する価値を犠牲にすることにならないでしょうか？それゆえアジャイルでは，コストの削減と収益の向上をともに約束しているのです。</p> 
  </blockquote> 
  <blockquote> 
   <p>ですからあなたの重視する点，おそらくは貴方自身がアジャイルを選択した理由が効率性の向上にあるのならば，その期待はきっと叶うことでしょう – さまざまな事が，これまでよりも早く片付くようになるはずです。しかし，ここで利益あるいは価値(つまり製品の結果)の増加という目標が度外視されているのなら，結果として組織の不可避な死を先延ばししているに過ぎません。いかにコストを削減したところで，利益創出の欠如を補うことはできないのです。</p> 
  </blockquote> 
  <p>氏はアジャイルを計測する手段としてAARRR(Acquisition/獲得, Activation/活性化, Retention/維持, Referral/紹介, Revenue/収益)，いわゆる&quot;海賊指標(Pirate Metrics)&quot;について言及している。アジャイルの価値を評価する上でまず最初に注目すべきなのは，&quot;Acquisition/獲得&quot;に関する情報を得るための指標だ。これが向上すれば，次の&quot;Activation/活性化&quot;評価へと中心を移すことが可能になる。</p> 
  <blockquote> 
   <p>このモデルをひとつの例として，アジャイル移行の運用面およびプロセス面に改めて適用するならば，私たちは何を指標として考えればよいのでしょうか？ &quot;Revenue/収益&quot;は&quot;Velocity/ベロシティ&quot;と等価なのでしょうか(そんなことはないでしょう)？ &quot;Acquisition/獲得&quot;は，ブートキャンプで訓練を受けた人の数で測ればよいのでしょうか？</p> 
  </blockquote> 
  <p>InfoQでは以前，<a href="http://www.infoq.com/articles/Jones-measuring-agile-adoption">アジャイル適用の評価に関してCapers Jones氏にインタビューしたことがある</a>。その場で氏は，ある方法論から別のものに移行する場合に使用可能な，基本的な指標をいくつか挙げてくれた。それらの指標は，アジャイルの価値計測にも用いることができるはずだ。</p> 
  <blockquote> 
   <p>生産性を評価する上で世界的にもっとも広く使用されている指標として，&quot;１人月あたりのファンクションポイント(FP)数&quot;と，その逆数である&quot;1FPあたりの作業時間数&quot;の２つがあります。生産性を判断する目的ならば，１人月あたり10FPを越えれば良好で，7FPを下回る場合は問題があると言えます。アジャイルプロジェクトの中には，人月あたり15FPを越えるものもあります。これはウォーターフォールではほぼ不可能な数値です。</p> 
   <p>品質を測定するためには，ファンクションポイントで正規化した&quot;欠陥ポテンシャル(DefectPotentials)&quot;と&quot;欠陥除去効率&quot;がもっとも効果的な方法です。欠陥ポテンシャルとは要件，設計，コード，ドキュメント，バグフィックスにおいて検出されたバグの合計数です。FPあたりの欠陥ポテンシャルが5を越えると不良，欠陥数が3を下回れば良好といえます。</p> 
  </blockquote> 
  <p><a href="http://www.infoq.com/author/Ken-Schwaber">Ken Schwaber</a>氏は，IT投資によって生み出される価値の評価方法を論じた&quot;<a href="https://www.scrum.org/Blog/ArtMID/1765/ArticleID/6/Agile-Value">Agile Value</a>&quot;というブログ記事を書いている。</p> 
  <blockquote> 
   <p>(...) 価値とは，支出に対して組織が受け取る財務的な利益として定義されます。測定された価値は，組織がひとつの部署ないし生産ラインであるかのように組織全体を包含するものであったり，あるいはそのような制約を課されたものかも知れません。いずれにせよ，支出に影響される領域を包含するものであることは間違いありません。</p> 
  </blockquote> 
  <p>投資の組織的な価値は，<a href="http://www.agility-path.com/Agility-Path-Framework">アジリティ・パス・フレームワーク</a>で定義されている<a href="http://www.agility-path.com/Solutions/Agility-Index-Snapshot">アジリティインデックス</a>という，単独の指標で評価することができる。この指標は，いくつかの指標から得た結果を組み合わせたものだ。</p> 
  <blockquote> 
   <ul> 
    <li>運用指標(Operational Metrics)。組織の効率性を評価するための指標。この指標はITに特化したもので，組織におけるソフトウェアの開発と導入という両面を評価する。フローやサイクルタイム，安定化，品質，利用率，リリースサイクルタイムなどがこの指標に含まれる。ビジネス運用効率は指標に含まれていないが，(John Kotter氏の)Kotter Internationalが2014年に行う&quot;Accelerate!&quot;プログラムの一部に取り込まれる予定だ。</li> 
    <li>組織的指標。市場における投資の効率化による影響，および組織的価値の増加を評価する指標である。従業員あたりの利益，顧客および従業員の満足度，製品ないしシステムのコスト比などがこの指標に含まれる。</li> 
   </ul> 
  </blockquote> 
  <p>スクラムのスプリント終了時に提供された価値を評価することができる，と氏は説明する。</p> 
  <blockquote> 
   <p>アジャイルプロジェクトにおけるスプリントやイテレーションは，完結したひとつのプロジェクトです。要件と予算，納期があり，終了時には完成したソフトウェア機能のセットが存在します。完了した内容に基づいて，別のプロジェクトを始めるにせよ始めないにせよ，完成した機能にさらなる機能が加えられます。スプリントはそれぞれ，独立して評価されるのです。</p> 
  </blockquote> 
  <p>Cutterのブログ記事 &quot;<a href="http://blog.cutter.com/2014/03/07/its-far-too-easy-to-measure-agiles-value-in-the-wrong-way/">It’s Far Too Easy To Measure Agile’s Value In The Wrong Way</a>&quot;には，アジャイルの価値評価における要件が検討されている。その中でTom Grant氏は，算出すべきこのガイドラインと回避すべき落とし穴について説明する。</p> 
  <ul> 
   <li>“アジャイルメソッドの価値とアジャイルチームが創出するソフトウェアの価値は同じではない” - ストーリのビジネス価値の見積は，組織にアジャイルを適用する投資の保証には役立たない。</li> 
   <li>“ビジネス価値はビジネスアクティビティのレベルに存在する” - ビジネス価値はストーリにあるのではなく，提供されたソフトウェアを使用するビジネスアクティビティにある。&quot;価値は物語やテーマのレベルで存在するのです&quot;と氏は述べている。</li> 
   <li>&quot;価値を算出する上で，ポートフォリオが何らかの役割を持たなければならない&quot; – 提供されるソフトウェアのビジネス価値は，そこに含まれていない機能に関連する部分もある。</li> 
   <li>&quot;価値は相互的評価である&quot; – 価値の評価には技術の提供者と利用者双方が含まれる必要がある。</li> 
   <li>&quot;評価の正確性を信じる人はいないが，それでも評価は有効だ&quot; – 価値を正確に算出できなくても，人々は議論の対象とする数値を求めるものだ。</li> 
   <li>&quot;ROI値は信じられないほど大きな値となる場合がある&quot; – あまりに高い数値は人々を懐疑的にするかも知れないが，それでも正しくないとは限らない。</li> 
   <li>&quot;収益への投資は投資からの収益より重要な場合もある&quot; – アジャイルへの不十分な投資が，アジャイル適用の失敗につながるかも知れない。</li> 
   <li>&quot;ROI以外にも評価値はたくさんある&quot; – アジャイル適用のビジネスケースにおいては，他の指標も同じように有効な可能性がある。</li> 
  </ul> 
  <p>読者はアジャイル適用のビジネス価値を測定しているだろうか？</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>