<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>VersionOne社CEORobert Holler氏へのインタビュー</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/02/versionone-winter2014-release"><em>原文(投稿日：2014/02/13)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p><a href="http://www.versionone.com/">VersionOne</a>は <a href="http://www.versionone.com/release/2014/winter/">2014年冬</a>のリリースについて発表した。仕事の両端に着目した新しい機能を持つ製品のリリースを発表している。Epic Release Planningは戦略的で組織全体の視点を支援し、Detail Viewsはチームの個々人に着目する。</p> 
  <p><br /> InfoQはVersionOneのCEOであるRobert Holler氏に新しいリリースについて、そして同社のこれからの計画について話を聞いた。</p> 
  <p>InfoQ<strong>:</strong> 本日はお時間を頂きありがとうございます。Agile 2014カンファレンスで話をしてから、VersionOneではどのようなことが起こりましたか。</p> 
  <blockquote>
    順調です。昨年は上手く終われましたし、新規採用もたくさん行いました。全体で44人の増員を行いましたが、これは、アジャイルのマーケットがとても好調で、私たちと一緒に働きたいと思っている人がたくさんいたということです。
  </blockquote> 
  <p>InfoQ: VersionOneの製品はどうなりましたか。</p> 
  <blockquote>
    私たちが大きな組織になりつつあり、アジャイルを試してみることからアジャイルを実践することへ移行していることを考えると、一番大きいのは規模の変化です。SAFeのようなフレームワークがいくつかありますが、顧客はプロジェクト全体、プログラム全体、ポートフォリオ全体に現れる混沌状態を解決するために私たちのツールのようなものを探しています。これは素晴らしいことではないでしょうか。
  </blockquote> 
  <p>InfoQ: ポートフォリオ全体/プログラム全体の管理を支援するVersionOneの商品について教えてください。</p> 
  <blockquote>
   振り返ると、SAFeの周辺に多くのメトリクスや指標、機能を追加してきました。今回の最新のリリースでは、重要な新機能を追加し、既存機能をアップデートしました。組織はストーリーのレベルでは計画を立てたがりません。組織のあるレベルにいる人にとって、このような計画の立て方はわずらわしいのです。戦略のレベルで計画し見積もるにはどうすればいいのでしょうか。また、エピック/スーパーストーリー/機能(どのような言葉を使ってもいいのですが)のリリースをどのように計画すればいいのでしょうか。ストーリーやストーリーレベルのリリース計画に加え、戦略的なレベルでリリースを計画することもできます。SWAG*のようなものを計測し、リリースのSWAGの計測値やリリースのストーリーポイントの計測値を利用するのです。
  </blockquote> 
  <p>*[編注: SWAG = scientific wild-assed guess]</p> 
  <blockquote>
   今回のリリースで進化したのは、昨年末に導入したPlanningRoomsの拡張です。PlanningRoomはオンラインの戦略管理会議室です。この部屋ではイニシアティブボード、機能ボード、戦略バックログ、それらに関連する分析を手に入れられます。組織のあるレベルでは、製品のバックログを見たいのではなく、代わりに大きな図を見る必要があります。VersionOneにログインして、自身のPlanningRoomを手に入れる代わりに、企業幹部や製品マネージャ、プロダクトオーナー、PMOなどによる別のリンクにアクセスできます。これによって、アクセシビリティが改善され、戦略チームへの導入もより徹底されます。
   <br /> この機能はTeamRoomを使っている開発チーム向けに1年前に既に提供しており、また、戦略家/プランナー、プログラムマネージャ向けにも似たような機能を提供しています。そして、今回のリリースでは、PlanningRoomsをより構成しやすいようにしました。最初に時点では、パネルとコンポーネントは限定的にしか公開されていませんでしたが、この機能を大幅に拡充しました。複数のボードやバックログを管理できるようにしました。シンプルに構成することもできますし、複雑にもできます。理想的にはシンプルにしたほうがいいと思いますが。また、オンラインの戦略室ですべての異なるプランニングやレポートティングスライスを扱えるようにしました。これは、戦略的意思決定の優先順位を付けるために必要です。さらに、各リリースでチームやユーザのエクスペリエンスを改善する機能を追加しようとしています。この最新のリリースでは、システム全体のすべての資産フローのための詳細ビューを作りました。システムで追跡しているすべての資産/アーティファクトのためにここ数年の間に大量のユーザからいただいたフィードバックを基づいて開発したビューです。私たちはより良いコラボレーション、リンクや添付ファイルをアクセスしやすくする方法、カスタマイズ可能なリッチテキストの説明フィールドを提供する方法を探していました。この詳細ビューは審美的であり、何が起きているかすぐにわかる機能を多く搭載しています。例えば、ストーリーを開くと、機能的であったビューが、エレガントで審美的になっているのがわかります。コラボレーションの文脈でストーリーを見ることができます。関連するリンクと添付ファイル、イメージとテーブルが組み込まれたリッチテキストフィールドなどの文脈で見ることができます。製品の中で最も使われている要素を取り出し、それを次のレベルに引き上げたということです。
  </blockquote> 
  <p>InfoQ: コンテンツの詳細へ直接的につながっているビューということですか。</p> 
  <blockquote>
   そうです。ストーリー、エピック、欠点、テスト、タスクなど製品のどのような資産でも見れます。すべての資産に一貫したビューを適用しています。従って、ビュー周りのユーザエクスペリエンスの改善はたくさん行いました。VersionOneのシステム全体で使われているからです。
   <br /> VersionOneでは、“投資テーマ”を策定し、それに従って行動しています。戦略の計画や投資テーマの整理、協力的投資テーマ、チームエクスペリエンス投資テーマなどです。これらのテーマによって、私たちは継続的な改善を試みています。特に、製品に対するチームや個人のエクスペリエンスは重要課題です。新しい機能を追加するだけでなく、機能のエクスペリエンスを改善し、より簡単に使えるようにし、シンプルでエレガントにするのは社内のコミットメントでもあります。
  </blockquote> 
  <p>InfoQ: 機能がふくれあがってしまうのはどのように避けていますか。</p> 
  <blockquote>
   ユーザエクスペリエンスに継続的に投資することです。私たちのように4つの異なるUI、機能的な違いだけでなく、美的な違いのある4つのUIを変遷を経験した会社は少ないでしょう。そして、最も本質的な機能追加だけを行っている会社もほとんどないはずです。また、背後では、柔軟性や構成、本質的でない機能に取り組んでいます。これは、ユーザーに本質的なアクションを提供し続けるためであり、そのような本質的なアクションの中でもさらに使いやすくなるように進化させるためです。
   <br /> 例えば、長年、リリースプランニングのメタファを使っていきました。とても良いメタファでしたが、さらに改善できると考え、少しの変更を加えて、使いやすく、明確に、戦略レベルでもストーリーレベルでもより効果を発揮できるようにしました。
   <br /> 私たちは、UIを進化させていくということ、顧客に負担をかけないようにするということに注力するという投資テーマにコミットしています。 
   <br /> さらに、TeamRoomとPlanningRoomでは、ユーザのペルソナを探り、そのニーズに合致した環境を提供するようにしました。アイディアをメインのアプリケーションに組み込むのではなく、専用のアドインモジュールを作り、開発チームと戦略チームの両方向けに特別に仕立てたのです。
  </blockquote> 
  <p>InfoQ: 投資テーマの明確なロードマップはありますか。</p> 
  <blockquote>
   プラットフォーム投資テーマやレポーティング、ビジュアライゼーション投資テーマなど、他の投資テーマもあります。
   <br /> 私たちのロードマップを語るということは、投資テーマの文脈の中でロードマップを語るということです。
   <br /> 私たちのテーマや戦略プランニング、テーマの整理はアジャイルを大きな規模でサポートするということです。高いレベルでの可視性、高いレベルでの計画、高いレベルでの取り組みをサポートするということです。そして、中核的な開発の外に向けて開発を拡大することです。
   <br /> コラボレーションテーマは企業全体のコラボレーションについてです。コラボレーションはアジャイルの基礎であり、私たちが明確にしたいのは、単一の議論をサポートするだけでなく、マネジメントシステム全体に渡る文脈を介した協力を提供するということです。コラボレーションはアドオンではありません。コラボレーションはアジャイルの計画や取り組み、レポーティングの基礎です。私たちはすべてのプロセス向けに明確なコラボレーション機能を提供しています。すべての意思決定、イノベーション、アイディア作り、すべての知識獲得はこの仕組みの一部です。例えば、3年前を振り返ってそのときの意思決定の理由を調べることができたら素晴らしいと思いませんか。私たちはそのようなことを可能な限りシームレスで明確なかたちで実現したいのです。
   <br /> チームエクスペリエンステーマは現在の困難を抱えているユーザが駆動します。オンライン分析で人々が抱えている課題を浮き彫りにします。また、私たちのオンラインのIdeaSpaceにはユーザが投稿できます。また、製品をシンプルにしてすべてのユーザが使いやすくなるようにする方法については、私たちも独自のアイディアを持っています。
   <br /> すべてのテーマに対して良い仕事をしようと思っています。顧客と戦略上の課題の両方に対処したいです。すべてが投資テーマの文脈の中にあります。私たちの投資テーマはアジャイルのライフサイクルマネジメントプラットフォーム全体に対する投資を戦略的にガイドしてくれます。
  </blockquote> 
  <p>InfoQ: お話を頂きありがとうございました。</p> 
  <blockquote>
   こちらこそありがとうございました。
  </blockquote> 
  <hr /> 
  <p>次のインタビューでは、Robert Holler氏に最新のState of Agileの調査結果について話を聞く。</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>