<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイルを用いたビジネスプロセスの改善</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/03/process-improvement-agile;jsessionid=D2F77C6C944D805855D2EC9315074A41"><em>原文(投稿日：2013/03/29)へのリンク</em></a></p> 
<div class="clearer-space">
 &nbsp;
</div> 
<div id="newsContent"> 
 <p>組織はビジネスプロセスの改善を望んでいる。そして今日，それは迅速に行う必要がある。ならばビジネスプロセスの改善に，アジャイルの手法やテクニックを使うことはできないだろうか？</p> 
 <p>Harvard Business Review の &quot;<a target="_blank" href="http://blogs.hbr.org/cs/2012/10/when_it_comes_to_operational.html">プロセス戦略における次の波 (the next wave of process strategy)</a>&quot; という記事に，Brad Power氏がビジネスプロセス改善のアプローチに対する自身の見解を公開している。過去数十年を掛けて改善されてきた手法によって，これまで多くのことが達成されてきた。しかし氏は，組織にはプロセスを継続的に改善する必要があると考えている。</p> 
 <blockquote> 
  <p>(...) 昨日の勝利を祝う時間などありません。組織にとって過去の成功は，今後10年間の継続的な発展を保証するものではないのです。なぜなら情報処理技術 (...) が，現時点でもっとも進歩したビジネスプロセスでさえ，10年後にはまったくの時代遅れにしてしまうからです。</p> 
 </blockquote>
 <blockquote> 
  <p>トップマネジメントにとって，組織のプロセス改善が必要かどうかはもはや問題ではありません。どのような方法を選択するのか，費用はどの程度か，いつ実施するのか，ということが問題なのです。</p> 
 </blockquote> 
 <p>そのような変化のひとつとして氏が指摘するのは，プロセス改善をより迅速に行うことの必要性だ。</p> 
 <blockquote> 
  <p>今日の企業は月や年ではなく，日あるいは週単位でプロセスを変えられなければなりません。</p> 
 </blockquote> 
 <p><a target="_blank" href="http://blogs.hbr.org/cs/2012/12/in_my_last_post_i_1.html">プロセス戦略の３つの実例 (three examples of new process strategy)</a> と題されたPower氏の次の記事では，組織がプロセスを改善するための新手法が紹介されている。</p> 
 <blockquote> 
  <p>私はこれらのプロセス改善アプローチを &quot;Process Strategy 2.0&quot; と総称しています。これらはリーン，シックスシグマ，ビジネスリエンジニアリングといった &quot;Process Strategy 1.0&quot; の方法論を越えるものです。</p> 
 </blockquote> 
 <p>プロセス改善の迅速化のニーズは増加している，それを充足するにはアジャイルのアプローチが必要だ，と氏は言う。</p> 
 <blockquote> 
  <p>運用と改善をスピーディにするため， Process Strategy 2.0では，即時の試行とアジャイル管理プロセスのより一層の活用を行います。</p> 
 </blockquote> 
 <p>InfoWorld ブログの記事 <a target="_blank" href="http://www.infoworld.com/t/agile-development/adapt-agile-build-better-business-204332">ビジネス改善へのアジャイル活用 (adapt agile to build a better business)</a> では，筆者であるAdvice Line blogsのBob Lewis氏が，Scrumを用いたビジネス変革の実現について解説している。最初に氏は，ビジネス変革の実現とソフトウェア開発との違いを明確にする。</p> 
 <blockquote> 
  <p>ビジネスの変革は，しかしながら，新しいソフトウェアをシステムに投入して，それを用いたビジネス改善の方法をユーザに見つけてもらう，という単純なものではありません。ビジネスの過程と実践，トレーニング，コミュニケーション，会計処理の変更，業績指標の再定義など，あらゆる問題を改善するためのタスクを伴うものなのです。</p> 
 </blockquote> 
 <p>プロダクトのバックログにあるユーザストーリは，ビジネスの変革を実現するために必要なものをすべてカバーできていなければならない。バックログの項目は &quot;新しいソフトウェアを使用して実際に処理を行う方法を説明する&quot; という，ビジネス変革を意図したものになるはずだ。</p> 
 <blockquote> 
  <p>ユーザストーリに取り組むことになれば，ソフトウェアに何ら関係のない部分については，相応な資格を持つビジネススタッフに割り当てられることになるでしょう。彼らは，ユーザストーリにアサインされた開発者たちが直接関与する作業に加えて，自身の作業についても責任を負うことになるのです。例えば &quot;新しいプロセスとソフトウエアに関するユーザ教育&quot; という項目はバックログに入れられて，他のすべてのユーザストーリと同等に管理されることになります。</p> 
 </blockquote> 
 <p>ビジネス変革に優先順位を設定する手段として氏が推奨するのは，Goldratt氏の TOC (Therory of Constraints) の利用である。</p> 
 <blockquote> 
  <p>TOCは明確なゴール – コスト削減，サイクルタイム短縮，生産能力向上といった – を確立することによって機能して，ゴール達成への唯一かつ最大の障害を特定します。これがボトルネック，すなわち制約(constraint)であり，それを取り除くことで目標の達成に一歩近付きます。その次には，残った制約から最大のものを特定して，それを取り除くのです。</p> 
 </blockquote> 
 <p>ビジネス変革にスクラムとTOCを組み合わせて使うことは，組織がアジャイル企業になる上でも有効だ，と氏は言う。</p> 
 <blockquote> 
  <p>(...) 企業がアジャイルであるためには，設計，計画，意図的な変化の達成を迅速かつ確実に行えることが必要です。</p> 
 </blockquote> 
 <p><a target="_blank" href="http://agilemanagement.net/index.php/Blog/change_management_vs_process_evolution/">チェンジマネジメント対プロセスの進化 (change management vs process evolution)</a> というブログポストの David Anderson 氏は，自身がチェンジマネジメントと呼んでいるビジネスプロセス改善のアイデアを紹介している。</p> 
 <blockquote> 
  <p>チェンジマネジメントは組織の変化を管理するための規律です。プロセスや組織構造の変更といったアクティビティに対して，何らかの管理性あるいはガバナンスを与える規律がチェンジマネジメントなのです。</p> 
 </blockquote> 
 <p>組織にアジャイルを適用するというのは，その行為自体が管理面での変革であり，時には困難を伴う。なぜアジャイルを採用するのか，氏は次のように説明している。</p> 
 <blockquote> 
  <p>アジャイル移行のアプローチ自体が非アジャイルである，すなわち大規模な事前計画を作成して実行するというアプローチである，というのは実に皮肉な話です。アジャイルに移行する試みの多くが十分な成果を上げられていない，という事実(これを私は，少なくとも５年間言い続けています)を考えれば，使用しているアプローチが問題のドメインに対して不適切なのかも知れません。必要なのは変化のためのアジャイルアプローチ - フィードバックループによって新たな情報を得られるように進歩したアプローチなのです。</p> 
 </blockquote> 
 <p>氏もLewis氏と同じく，Goldratt氏のTOCに言及している。氏が推奨するのは，最大の制約に注目してそれを排除する，という進化的変革を管理するために，TOCの改善の５ステップをソリューションとして採用することだ。</p> 
 <blockquote> 
  <p>(...) 重要なのは小さな変更を行うことです。はるかに先の変化を事前に予測することはできません。２ないし３ステップ程度が，おそらくはベストなのでしょう。移行作業全体を予見することは不可能です。</p> 
 </blockquote> 
 <p>カンバンやリーンスタートアップといったメソッドは，組織の変革を阻む最大制約を見つけ出すのに役立つはずだ。</p> 
 <blockquote> 
  <p>カンバンは進化的変革の可能性を企業に提供します。(...) カンバンを用いることで，適合基準による現行プロセスの評価が可能になります。それによって私たちは，プロセスを発展させるためにどのような変化を導けばよいのかを判断できるのです。</p> 
  <p>リーンスタートアップもこれと同じように，Eric Ries氏がビジネスモデル改革のアプローチとして紹介したものです。(...) リーンスタートアップによる適合基準は，より市場に直結したものになります (...)リーンスタートアップにあるビジネス上の仮説立証というコンセプトは，変革時において適合基準を適用するためのプロセスに相当します。</p> 
 </blockquote> 
 <p><a target="_blank" href="http://www.softwareag.com/blog/reality_check/index.php/process-power/process-improvement/">組織はいかにして真のプロセス改革を実現するか (how organizations achieve real process improvement)</a> と題するブログ記事では，Software AG のエンタープライズBPMのトップを務める Joerg Klueckmann氏が，プロセス改革を実践する組織での経験について語っている。紹介されている組織のひとつが Cable &amp; Wireless だ。</p> 
 <blockquote> 
  <p>Process Excellence は，ミッションクリティカルな通信インテグレータとしての Cable &amp; Wireless のビジョンの中核をなすものです。同社は組織における BPM を IT のレベルからよりビジネス戦略的なレベルへと上昇させました。そして稚拙なプロセスから Process Excellence へと移行した自らの経験を公開したのです。</p> 
 </blockquote> 
 <p>Cable &amp; Wireless はパフォーマンス改善を，同社のプロセス改善戦略上のひとつのコンポーネントとして考えている。</p> 
 <blockquote>
  パフォーマンス改善： プロセス間およびプロセス内の改善プロジェクトのポートフォリオへの優先度設定と実施を行うための，一環性および継続性を備えた改善方法論。
 </blockquote> 
 <p>Cable &amp; Wireless におけるプロセス改善のベストプラクティスのひとつがアジャイルプロセスだ。氏はアジャイルが，迅速な変革に一役買っていると述べている。</p> 
 <blockquote> 
  <p>アジャイルプロセス - 単純な IT アジャイル開発の意味ではなく，ビジネスより発する俊敏な (管理された) 変革。</p> 
 </blockquote> 
 <p id="lastElm">&nbsp;</p> 
</div> 
<p id="lastElm"></p><br><br><br><br><br><br></body></html>