<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>QCon Tokyo 2014 【組込み系／モノづくり】 トラックのご紹介</h3><p><a href="http://www.qcontokyo.com/" target="_blank">QCon Tokyo</a>&nbsp;は、最新技術を追い求めるデベロッパのための情報コミュニティ「InfoQ」が主催する、エンジニアによるエンジニアのためのワールドワイド カンファレンスです。そのカテゴリのひとつとして「組込み系／モノづくり」トラックをご用意しています。</p>
<p>日本のお家芸ともいえる組込み系ソフトウェアの開発にも今ひしひしと変革の波が押し寄せています。安くて高機能の家電製品や組込み機器を提供すれば飛ぶようにモノが売れる時代は終わり、以下に付加価値を付け、モノとサービスと環境の総合的な組合せによって今までにない体験をいかに提供できるか。スピーディなデリバリと意外性、そして充実した使用感が求められるという新しい次元にモノづくりは突入したといえるでしょう。</p>
<p>昨年は3Dプリンターの広げる新しいモノづくり環境の可能性を慶応大学 田中徹也準教授の基調講演で熱く語っていただきました。今年は東大に入学できる人工頭脳・ロボットの研究開発に本気で取り組む国立情報学研究所の新井紀子先生の基調講演をとおして、モノづくりがソフトウェアのみならず数学・論理学・人工知能・ロボット・脳科学・社会学等の総合的な知見を新しい知の体験・革新的なサービスとして組み立て直すという世界的な大きな潮流を感じ取ってもらえればと思います。</p>
<p>「組込み系／モノづくり」トラックの一般講演については3本用意しました。</p>
<p>まず、日本マイクロソフト太田寛 氏【ブログ:<a href="http://blogs.msdn.com/b/hirosho/" target="_blank">デバイスとITの架け橋</a>】と豆蔵 技術コンサルティング事業部による「フィジカル・コンピューティングにおける.Net Micro Frameworkの可能性」です。Micro Frameworkとは、Microsoft Reserch（Microsoft社の研究部門）開発の小規模組込み向けを狙い、Apache License V2.0によるOpen Sourceのオペレーティング・システムです。MMUなしの32bit CPUで256KB ROM, 64KB RAM のメモリ構成で動作し、ARMやX86、SHなど、さまざまなCPUアーキテクチャで実行可能です。組み込みアプリケーション開発がVisual Studio上で手軽に行え、実機でのソースコード・デバッグ、シミュレータ・デバッグ機能も利用可能。バーチャルマシンやライブラリのソースコードも開示されています。今後、メカ、エレキとITを融合したモノづくりのプロトタイピングや実際のプラットフォームとして非常に有用です。最後に紹介するデモでは、.NET Micro Framework と .NET Gadgeteer を用いてセンサーを制御し、センサー情報をクラウド（Azure）に蓄積するM2Mの一例をご紹介します。とくに、センサー情報をクラウドに蓄積する組み込み機器と、クラウドのセンサー情報をきっかけに動作する組み込み機器の2台が、クラウドを経由して協調動作するところにクラウドとフィジカルコンピューティングの融合する未来を感じ取っていただければと思います。</p>
<p>2つめのセッションは、<a href="http://www.intel.co.jp/content/www/jp/ja/homepage.html" target="_blank">インテル株式会社</a>ソフトウェア＆サービス事業部ソフトウェア開発製品部テクニカル・コンサルティング・エンジニアの林 侃(はやし かん)氏による「IA搭載組込み機器向けソフトウェア開発製品のご紹介」です。PCやサーバーだけでなく、様々な組み込みシステムにおいてもインテルのアーキテクチャーは採用されています。性能要件によっては、ソフトウェア開発においてプロセッサーの性能を引き出し、搭載される複数のコアを最大限活用する必要があります。本セッションでは、IA搭載の組み込みシステムのために役に立つインテルのソフトウェア開発製品をご紹介します。</p>
<p>3つめのセッションは、<a href="http://mobiquitous.com/" target="_blank">はこだて未来大学</a>の塚田浩二 準教授による「生活家電インターフェースの新潮流（仮）」です。栗原一貴氏との共同研究「SpeechJammer」がイグノーベル賞（Acostics Prize)を受賞したことでも有名です。食事を「奏でる」フォーク: EaTheremin(イーテルミン）や身の回りにある様々な日用品に小型のセンサやコンピュータを搭載し，情報技術で「拡張」された日用品を用いて生活をさりげなく支援するシステム「日用品インタフェース」を提案・開発されています。今回もあっと驚く斬新なアイデアで、日本のモノづくりに新しい風をもたらしてくれる研究をご紹介いただきます。</p>
<p>そして、さいごのビアパーティにもぜひ参加していただいて、スピーカーも含めた参加者のみなさんと交流し、みんなで「あたらしい日本のモノづくりの未来」を考え、開発現場に夢を持ち帰りましょう！</p>
<div>
 &nbsp;
</div>
<blockquote> 
 <div>
  ●開催概要
 </div> 
 <div>
  &nbsp;
 </div> 
 <div>
  開催日時：2014年4月30日(水) 10:00-19:00 (19:00～ ビアパーティあり)
 </div> 
 <div>
  &nbsp;
 </div> 
 <div>
  会　　　場：アルカディア市ヶ谷
 </div> 
 <div>
  &nbsp;
 </div> 
 <div>
  公式サイト：http://qcontokyo.com/
 </div> 
</blockquote>
<div>
 &nbsp;
</div>
<p>&nbsp;</p><br><br><br><br><br><br></body></html>