<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイル導入の技術的実践、システム思考、文化の問題</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/11/agile-adoption-europe-xpdays"><em>原文(投稿日：2013/11/05)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>単純さ、フィードバック、コミュニケーション、尊敬と勇気。これらのエクストリームプログラミング(XP)の価値はいまだに<a href="http://www.xpday.net/Xpday2013/FrontPage.html">XP Days Benelux 2013カンファレンス</a>のチームに刺激を与えている。2日間開催されるカンファレンスでは、テストや開発手法、顧客と計画、個人、チーム、プロセス、継続的な改善などアジャイル関連の多くの話題を取り上げる。</p> 
  <p>InfoQはカンファレンスの主催者であるMerlijn van Minderhout氏とPascal Van Cauwenberghe氏に、アジャイルでの新しい開発、アジャイルへうまく移行すること、アジャイル推進のためのヨーロッパ地域の組織の必要性について話を聞いた。</p> 
  <p><strong>InfoQ: アジャイルコミュニティではどのような新しい開発が行われていますか。なぜそのような開発が行われているのでしょう。</strong></p> 
  <blockquote> 
   <p><strong>Pascal</strong>: 確証バイアスかもしれませんが、XPの技術的な実践やレガシーコードの扱い方について多くのセッションがあります。技術的な洗練具合が無視されていた“ラピッドデベロプメント”の時代は過ぎ、“技術的負債”のおかげで“アジャイル”プロジェクトは立ち往生してしまっています。コードの柔軟性を保たなければ、アジャイルを続けられないという事実に意識的な人が増えてきているのは良いことだと思います。</p> 
  </blockquote> 
  <p><strong>InfoQ: カンファレンスでは技術的なトピックやチーム、個人、プロセス、顧客や計画までを取り扱います。アジャイルへ移行するにあたり、これらのことをすべて考慮しなければならないのなら、移行を計画し実施するのはとても難しいことではないですか。</strong></p> 
  <blockquote>
   <strong>Pascal</strong>: 短く答えれば、イエスです。長く答えれば、イエスであり、難しいからこそシステマチックな手法(システム思考、複雑思考、制約の理論…)を使って自身をガイドし、システムを理解してどこにてこの力を働かせるかを見つける必要があります。単純なひとつの“計画と実行”では済みません。理解し、変更を案出し、実験を行い、レビューするというループを無限に繰り返します。XP Daysの主催者はこのサイクルを“アジャイルシステム”と読んでいます。システム思考とアジャイルを組み合わせてアジャイルシステムです。
  </blockquote> 
  <p><strong>InfoQ:アジャイルへの移行が成功しなかった例を耳にすることがあります。なぜ失敗するのでしょう。成功の度合いを増やすにはどうしたらいいのでしょうか。</strong></p> 
  <blockquote>
   <strong>Merlijn</strong>: アジャイルはスタート地点はシンプルですが、アジャイルへの移行はシンプルではありあません。前述の質問と回答で示した通り、アジャイルの移行は多くの領域に関連します。複雑性が現れ、複雑になれば、ミスが生まれます。そして、ミスをしてしまうこと(積極的に早い段階で頻繁に失敗すること)は学習と改善を促します。多くの組織が新しいスタート地点について議論せずに、失敗した場所で立ち止まってしまっています。
  </blockquote> 
  <p><strong>InfoQ: ヨーロッパとほかの地域ではアジャイルの導入に違いはありますか。ヨーロッパに特定の組織は必要でしょうか。あるいは、ヨーロッパのアジャイルコーチが使っている手法とはことなる手法が必要ですか。</strong></p> 
  <blockquote>
   <strong>Merlijn</strong>:ヨーロッパ内でも違いがありますし、ヨーロッパの国の中でも違いがあります。アジャイルへの移行には企業文化が大きく影響します。例えば、考え方がオープンで、ミスに対する寛容さがあれはコミュニケーションが増大します。世界のどこにある組織か、ということよりも、企業文化のほうがアジャイルへの移行に成功するかどうかに影響を与えるのではないでしょうか。もちろん、企業文化はその国の文化に強く影響を受けているわけですが。
  </blockquote> 
  <p><strong>InfoQ: XP Days BeneluxカンファレンスはXPの守備範囲を超えたトピックを扱っていますね。スクラムやカンバン、組織の変化についても扱っています。カンファレンスの名前を変えようとは思わなかったのですか。</strong></p> 
  <blockquote> 
   <p><strong>Pascal</strong>: もちろん、毎年考えています。儀式の一種ですね。そして、いつも同じ結論に達するのです。“XP精神”、そしてXPの価値は未だに私たちにとって重要だという結論です。このXPの価値がXP Daysをどのようにするかについて着想を与えてくれます。単純さ、フィードバック、コミュニケーション、尊敬と勇気。うまくいかなかったことを報告する勇気。オープンであり、新しいことに挑戦する勇気。知らないことを認める勇気。境界を押し進め、常により良いことをして、安易な保守的態度に満足しない勇気。つまり、ポストイットでシステムをビルドしているのではないということです。優れた技術的実践こそ持続的なアジャイル実践の前提なのです。</p> 
  </blockquote> 
  <p>&nbsp;</p> 
  <p>カンファレンスは11月28日と29日にベルギーのメヘレンで開催される予定。アジャイルの手法とシステム思考を広めることを目的にした非営利団体<a href="http://www.agilesystems.org/">Agile Systems</a>がサポートする。InfoQは昨年のXP Days Benelux 2012カンファレンスの<a href="http://www.infoq.com/news/2012/11/xpdays-benelux-day-1">1日目のセッション</a>と<a href="http://www.infoq.com/news/2012/11/xpdays-benelux-day-2">2日目のセッション</a>の内容を特集している。</p> 
 </div> 
</div><br><br><br><br><br><br></body></html>