<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイル採用における “マネジメント・バイ・イン” とサポート</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/01/management-support-agile"><em>原文(投稿日：2014/01/30)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>アジャイルの採用は，マネジメントを含む組織改革だ。その成功にはマネジメント・バイ・インが不可欠であると言われている。マネジメントによるサポートの欠如は，アジャイル移行の障害にもなりかねない，というのだ。しかしマネジメントがアジャイルをサポートする方法は，企業によってさまざまだ。</p> 
  <p>&quot;<a href="http://www.scrumalliance.org/community/articles/2014/january/prescriptive-scrum">Prescriptive Scrum</a>&quot;と題したブログ記事では，Arijit Sarbagna氏が，マネジメント・バイ・インの重要性とアジャイル採用に対するサポートについて書いている。</p> 
  <blockquote> 
   <p>私たちが，あるアジャイルプロジェクトに従事しているものとしましょう。そのアジャイル展開はトップダウンではありません。むしろ “ボトムアップ” によるちょっとした試み，といった感じのものです。このような場合の私たちには，ある重要な要素が欠けています。それが &quot;マネジメント・バイ・イン&quot; と呼ばれるものです。このサポートがなければ多分，おそ自己組織型チームを構築しようとする私たちの善意のほとんどが行き詰まるという，そんな状態に踏み込んでしまうことでしょう。そしてスクラムマスタあるいはコーチとして私たちが払う努力の大部分は，チームを実際にガイドするよりも，マネジメント(さらに言えば，あるいは顧客も)の説得に費やされることになるのです。</p> 
  </blockquote> 
  <p>氏によれば，自己組織化チームのサポートはマネージャにとって，時に困難を伴うものだ。</p> 
  <blockquote> 
   <p>(...)マネジメントチームは，&quot;自己組織化&quot; をチームにどの程度まで任せるか決定する，というジレンマに苛まれます。 これは面白い部分です。私たちがアジャイルの効用についてマネジメントを説得しなければならない一方で，アジャイルを有益なものにするために，彼らもアジャイルを信頼しなければなりません。お互いを信用できなければウォーターフォールであっても成功しないのだ，と彼らに思い出してもらうことも時には必要でしょう。信頼は成功の柱です。その上にエンジニアリングの実践があるのです。</p> 
  </blockquote> 
  <p>しかしマネジメントはスクラムを強要するべきではない，と氏はいう。</p> 
  <blockquote> 
   <p>もし私たちが規範的なスクラムというものに悩んでいるとすれば，それは多分，アジャイルはどう行うべきか(あるいはどう行うべきではないか) ということを，マネジメントによって指示されているのです –– おそらくはアジャイルを実践した経験が<i>まったく</i>なく，理論だけを，それも質の悪いことに &quot;失敗例&quot; だけを表面的に学んだ人々のグループによって，です。</p> 
  </blockquote> 
  <p>代わりに氏が奨めるのは，&quot;アジャイルを理解するように説き，<i>励まし</i>，その上で実践を取り入れる&quot; ことだ。</p> 
  <p>Zvonimir Križ氏は &quot;<a href="http://zvonekriz.com/2013/10/16/dear-management-were-already-agile/">Dear management, we’re already agile</a>&quot; というブログ記事に，マネジメントによるサポートのないことが本当にアジャイル採用の障害となるのだろうか，という疑問について書いている。本当の問題は，原則よりも実践を重視した結果としての，トップダウンアプローチがアジャイル導入の唯一の方法であるという認識にあるのではないか，と氏は言う。</p> 
  <blockquote> 
   <p>スクラムなどの実践から直接手掛けてしまうと，アジャイルを進めるためには，組織の深い部分の改革が必須であるかのように思うのかも知れません。そして組織を変えるには – マネジメントのサポートが必要，そう思うのです。さらに興味深いもうひとつの理由は，ウォーターフォール自体にあります。より正確には，ウォーターフォールの特徴である事前計画のルールに，です。すべてのものは詳細に計画されていなければ成功しない，という考えは，私たちの脳に組み込まれた思考的遺産のようなものです。アジャイル導入も例外ではありません。このような大規模な事前計画と決断に必要なのが，またしてもマネジメントなのです。</p> 
  </blockquote> 
  <p>氏が指摘するのは，アジャイルの採用はボトムアップアプローチでも可能である，ということだ。</p> 
  <blockquote> 
   <p>忘れられがちですが，アジャイル適用へのボトムアップアプローチはすべて合法的です。</p> 
   <p>アジャイルの原則を適用するのにマネジメントに頼る必要はありません。それを皆が知るべきです。(…) 明日からだって始められます。遠慮はいりません！</p> 
  </blockquote> 
  <p><a href="http://www.infoq.com/author/Jeff-Sutherland">Jeff Sutherland</a>氏は&quot;<a href="http://labs.openviewpartners.com/agile-done-right-agile-gone-wrong/">Agile Done Right and Agile Gone Wrong</a>&quot;というインタビューの中で，リーダシップとチームに関して語っている。<a href="https://plus.google.com/+JeffSutherland/posts/JLsrKtKJwo3">氏はこのインタビューをGoogle Plusのページで公開</a>して，マネジメントが自らアジャイルを行うことで，アジャイルをサポートすることは可能だ，と述べている。</p> 
  <blockquote> 
   <p>マネジメント・バイ・インは関係ありません。アジャイルのマネジメントがアジャイルであること，変化をリードし実践することが重要なのです。大規模な企業の中には，上級マネジメント機構がスクラムチームであるものがあります。彼らはスクラムを許可しているのではありません。自らがスクラムを実践して，チームにもそれを期待しているのです。</p> 
  </blockquote> 
  <p>ならば中間マネジメントはどうだろう。彼らはアジャイル採用をサポートしてくれるだろうか？ Em Campbell-Pretty氏が，&quot;<a href="http://www.prettyagile.com/2013/10/advice-for-agile-coaches-on-dealing.html">Advice for Agile Coaches on 'Dealing With' Middle Management</a>&quot; という記事を書いている。マネジメント・バイ・インが重要な理由について，氏は次のように説明する。</p> 
  <blockquote> 
   <p>開発チームで作業する場合，中間マネジメントのバイ・インが非常に重要です。中間マネジメントはアジャイルへの移行活動を促進する力にも，クリプトナイトにもなり得ます。マネジメントがアジャイルをサポートしてくれないと感じたとき，チームは実験の安全や失敗のリスクをどう思うでしょうか？ 私はこれまで，マネジメントが従来型の考え方に固執する組織に対して，アジャイルを導入しようとする試みを見てきました。この状況では，アジャイルの価値である透明性などに注力しているチームが，真実を暴露したためにマネジメントによって懲戒されるような，ひどい結果にもなりかねません。</p> 
  </blockquote> 
  <p>中間マネージャの抵抗に対処するために，氏はひとつの提案をしている。</p> 
  <blockquote> 
   <p>一部のマネージャは，アジャイルを脅威と見ています。アジャイルを実践することは変革とほとんど同義ですし，変革されることを望む者はいません。この様な場合は，抵抗するマネージャにアジャイルを &quot;投げつける&quot; のではなく，Dennis Stevens氏やMike Cottmeyer氏のAgile 2013でのアドバイスだったと思うのですが，アジャイルの話をしないようにするとよいでしょう。その代わりにビジネスの目的や，マネジメントの目標達成あるいは苦痛軽減に注目するのです。</p> 
  </blockquote> 
  <p>中間マネージャは多くの場合，組織において困難な立場にある。アジャイルコーチはそれを考慮に入れて，彼らと連携し，彼らをサポートする方法を探すべきだ，と氏は言う。</p> 
  <blockquote> 
   <p>中間マネージャという立場は楽ではありません。彼らは基本的に，組織の上級幹部と実務スタッフの間に挟まれた &quot;サンドイッチの肉&quot; なのです。権限以上の責任を負わされていることも珍しくはありません。フラストレーションを強く感じることもあるでしょう。巨大な官僚型組織において，権力を否定された中間マネージャがどのように思うのか。その直接的な結果が指揮統制型マネジメントの蔓延なのではないか，とも疑われてしまいます。中間マネジメントの注意の先を縦割り組織への不満から引き離して，一緒に働く同僚の作業環境の向上へとシフトすることは，マネージャとチームの双方にとって有益なことかも知れません。中間マネージャも他の人と同じです。WIFM (What’s In to For Me – 私にとってのプラスは何?) に捕らわれやすい，ということを忘れないでください。アジャイルが彼らに好結果をもたらすものであることを，彼らが理解する必要があります。</p> 
  </blockquote> 
  <p>Mike McLaughlin氏は&quot;<a href="http://blogs.versionone.com/agile_management/2013/08/16/the-agile-coach-on-patience/">The Agile Coach in Patience</a>&quot;というブログ記事を書いて，アジャイル導入の中間マネージャへの影響について語っている。</p> 
  <blockquote> 
   <p>中間マネージャの多くは，コントロールを手放すことに抵抗を感じているようです。 まだ介入の必要があると思っているのです。何年もの間，ことによれば何十年もマイクロマネージングを続けてきた彼らにとって，その慣行を破るのは簡単ではありません。チームにもっと権限を与えることの重要性について，トレーニングを受けてはいても，心の奥ではチームがそれを扱えるという確信を持てていません。ですからマイクロマネージを続ける必要がある，と考えるのです。</p> 
  </blockquote> 
  <p>自己組織化の採用は，中間マネージャとチームにとって難しいことなのかも知れない。</p> 
  <blockquote> 
   <p>[中間マネージャは]事実上，チームが自己管理型，自己組織型チームへと発展するのを妨げています。その結果チームは，チームの方向性やチーム自身が何かを行うための権限を中間マネージャに求め続けます。私はこれを &quot;中間マネージャの罠(Middle Manager Trap)&quot; と呼んでいます。彼らは意思決定を止めません。その一方で彼らは，アジャイルチームが自分たちのような責任能力を持ち合わせないことを疑問視します。これでは悪循環です。</p> 
  </blockquote> 
  <p>中間マネージャがチームを信頼し，チームに自己組織化を開発する猶予を与えさえすれば，アジャイルの採用をサポートすることは可能だ，と氏は考えている。</p> 
  <blockquote> 
   <p>信じて思い切ること，信頼すること，委譲すること，忍耐すること。これらはみな，他の人々に対する投資に他なりません。新たなアジャイルチームに対して良好なROIを得るには，かなりの時間を要するかも知れません。チームあるいは特定の個人が，門の外に出て行こうとすることもあるでしょう。一時的な遅れは構いません。ここでは長期的に考えることが必要なのです。</p> 
  </blockquote> 
  <p>Brian Erwin氏は，<a href="http://blog.projectconnections.com/project_practitioners/2013/11/an-open-letter-to-executives-leading-agile-transformations.html">アジャイル転向をリードする幹部社員への公開書簡</a>を書いた。氏はマネジメントに対して，自分たちの社員の善良さ，誠実さ，勤勉さを信頼すること，そして，彼ら自身の仕事をしやすい環境下でのアジャイル導入をサポートすることを提案する。</p> 
  <blockquote> 
   <p>スクラムやXP(eXtreme Programming)，かんばんなどのアジャイルメソッドを単に導入して義務付けるのではなく，社員や同僚が自分たちの仕事をする上で，アジリティがもっとも抵抗の少ない方法であるような組織環境を作り上げてください。</p> 
  </blockquote> 
  <p>氏の公開書簡には，マネジメントがこのような環境を構築するための行動計画も含まれている。提案の内容は次のようなものだ。</p> 
  <blockquote> 
   <p><strong>組織に対して望む行動を自ら実践することから始めること。</strong>機運を高めるためのもっとも強力な方法のひとつは，まず自分自身と自分の行動を変えてみせることです。人の内面的な変革を実際に強制することはできませんが，きっかけを与えることはできます。(…)</p> 
   <p><strong>チームレベルで方法論を強制しないこと。</strong>チームに対しては，スクラムなどの方法論的フレームワークを要求するのではなく，アジリティの材料を提供してください (...)。あなたの個人的なサポートを提供し，組織的障害や機能的障害を取り除くことを約束し，それらを実証したのならば，邪魔にならないように身を引いておくことです。(…)</p> 
   <p><strong>あなたのワークフォースとチームに注力すること。そうすれば，彼らもあなたに注力してくれるだろう。</strong> (...) チームが自らのすべてを進んで提供するような環境を構築し，コミュニティのために尽くす企業経営を行い，ワークフォースに投資することでその価値を認めていることを実証すれば，あなたとあなたの組織は今後長い間，マーケットの競争においてより大きなチャンスを掴むことができるでしょう。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>