<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>アジャイルのレトロスペクティブに目標と仮説を加える</h3><p><a target="_blank" href="http://www.infoq.com/news/2014/01/hypotheses-retrospectives"><em>原文(投稿日：2014/01/02)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>アジャイルレトロスペクティブを正しく実施することによって，チームは自ら学び，向上することができる。さらに目的を設定し，仮説を使ってレトロスペクティブ活動が改善に結び付いているかを評価することにより，レトロスペクティブはより効果的なものになる。</p> 
  <p>フォロースルーの欠如は，レトロスペクティブが改善に到達できない大きな理由のひとつである – Thomas Cagley氏は“<a href="http://tcagley.wordpress.com/2013/08/21/retrospectives-obstacles-daily-process-thoughts-august-21-2013/">Retrospective Obstacles</a>” の中でこう説明する。</p> 
  <blockquote> 
   <p>チームの冒す最悪のミステークは，レトロスペクティブを実施した結果に対して何もしないことです。活発な議論そのものはカタルシスであったかも知れませんが，結果的には時間を無駄にしたに過ぎません。</p> 
  </blockquote> 
  <p>確実にアクションが取られるようにするためには，改善が明示的で目に見えるものでなければならない，と氏は指摘する。</p> 
  <blockquote> 
   <p>すべてのレトロスペクティブは，改善の目標あるいはアイデアを最低ひとつは示さなくてはなりません。その目標をスプリントのバックログに追加して，チームが提供を約束している他の作業と同じように扱うことが必要です。</p> 
  </blockquote> 
  <p>ブログ記事&quot;<a href="http://www.agile42.com/en/blog/2013/08/28/sprint-retrospectives/">Retrospectives that rock</a>” の中でDave Sharrock氏は，ミーティングに目的を加えることで，レトロスペクティブを効果的なものにする方法について説明している。</p> 
  <blockquote> 
   <p>(...)レトロスペクティブに新たなレベルのエネルギーを注入するもっとも単純な方法は，振り返りの対象を決める最初の段階で，その意図を示す明確な質問を設定しておくことです。</p> 
   <p>その意図が価値を持つためには，すべてのメンバに関連する明確なものであるのと同時に，絶対に利己的なものであってはなりません。それらは，スプリントの成功そのものとは無関係な具体的な問題 (例：同じ時間で２倍のストーリを提供するためにはチームをどのように変えなくてはならないか？) を見つけることかも知れませんし，あるいはチームが無視している組織的な問題 (例：新機能の規定準拠についての承認を受けるまでの待ち時間を解消ないし削減するにはどうすればよいか？) を対象とするものかも知れません。</p> 
  </blockquote> 
  <p>Bob Marshall氏は “<a href="http://flowchainsensei.wordpress.com/2012/05/30/retrospectives-wronger-and-righter/">Retrospectives - Wronger and Righter</a>” の中で，仮説で始まるPDCAサイクルこそがレトロスペクティブのルーツである，と氏が考える理由を説明している。</p> 
  <blockquote> 
   <p>普通のレトロスペクティブを特別なものにするには，どうすればよいでしょう？ それはルーツに戻ることです。具体的にはPDCA (シューハートサイクル) です。“計画(Plan)” という言葉は，スクラムであれば “スプリント計画”，“リリース計画” というように，単純なコンテキストで捕らえられがちです。しかしながら，フランシス・ベーコンの “科学的手法” に起源を持つ本来のPDCAでは，“計画” とはすなわち<em>仮説</em>を意味するものです。</p> 
   <ul> 
    <li>“仮説” – <em>Plan</em></li> 
    <li>“実験” – <em>Do</em></li> 
    <li>“評価” – <em>Check</em></li> 
    <li>(コントロール – 後で追加) – <em>Act</em></li> 
   </ul> 
   <p>この見地に立った場合，レトロスペクティブは “私たちが期待していたこと – <em>仮説</em> – は実際に起こったのか” という疑問に答える<em>ものでない限り</em>，すべて無意味です。もしそうなら，なぜそうなのか。そうでないのなら，なぜそうでないのか。<em>最初に仮説がなければ，自分自身にこのような質問をすることはできません。</em></p> 
  </blockquote> 
  <p>Marc L&ouml;ffler氏は “<a href="http://blog.scrumphony.com/2012/09/inject-purpose-into-retrospectives/">Inject Purpose into Retrospectives</a>” というブログ記事の中で，目的の欠如こそが，レトロスペクティブをよりよくするために取り組まなくてはならない根本的要因だ，と説明している。</p> 
  <blockquote> 
   <p>目的を持たないレトロスペクティブは，すべて時間の浪費に過ぎません(どのような会議にも言えることですが)。背景となる目的がなければ，レトロスペクティブを定期的に見直したり，新しいアイデアを導入したところで，何の意味もないのです。</p> 
  </blockquote> 
  <p>氏は<a href="http://www.infoq.com/articles/Agile-Retrospective-Derby-Larsen">Diana Larsen，Esher Derby両氏の著書 &quot;Agile Retrospectives”</a>にあるレトロスペクティブフローを，リーンスタートアップに代えて，同じ方法で仮説を用いることで適用している。”仮説を加える“ ことで ”何をすべきかを決める“ ステップを拡張すると同時に，データ収集の後に ”仮説を検証する“ ステップを導入するのだ。</p> 
  <blockquote> 
   <p>(...) 直接的に考察を行うのではなく，前回のレトロスペクティブでの仮説を検証するのです。前回のレトロスペクティブ以降のタスクが期待した成果(つまり仮説)に達しているか，検証するチャンスを与えてくれるという意味において，これは非常に有効な方法です。ほとんどの場合，仮説が間違っていたということに気付くでしょう。 前回時点で認識していたタスクをすべて消化できたかを単に確認するだけではなく，それらが有効であったか，肯定的な効果を持っていたかを検証できるのです。もし仮説が間違っていたならば，期待された結果を得られなかった理由を確かめるための機会になります。</p> 
  </blockquote> 
  <p>仮説を設定して，次のレトロスペクティブでそれを検証することは，レトロスペクティブに目的を与えてくれる，と氏は言う。そしてそれは同時に，レトロスペクティブ活動の価値を確認する手段でもあるのだ。</p> 
  <blockquote> 
   <p>関与するすべてのタスクに仮説を追加する必要があります。そうでなければタスクの成果を検証できません。仮説が科学的な方法によってテスト可能である，ということの確認も必要です。テストできなければ，仮説には意味がありません。</p> 
  </blockquote> 
  <p>Bob Boyd氏は，<a href="http://implementingagile.blogspot.nl/2013/01/retrospectives-with-scientific.html">科学的検証を加えたレトロスペクティブ</a>を行うための，８ステップからなるプロセスを提案している。リーンスタートアップのコンセプトに従ったこれらのステップは，レトロスペクティブで決められた行動が期待した改善を達成できたかどうか，評価を行う上で有効だ。</p> 
  <blockquote> 
   <p>1. 改善によって解決の必要な問題そのものを明確に述べる<br /> 2. 改善が実施された結果はどのようなものになるかを明確化する<br /> 3. 改善について反証可能な仮説を作成する (これは実験の要約でもある)<br /> 4. 収集する評価値，計測値を明確にする<br /> 5. 計測データの収集手段を明確にする<br /> 6. 収集した計測データの表現方法を明確にする<br /> 7. 仮説が合理的疑いの余地なく真である，と証明する方法を明確にする<br /> 8. 仮説が合理的疑いの余地なく偽である，と証明する方法を明確にする</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>