<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8" /></head><body><h3>ふりかえりはリーンスタートアップの学習をどのようにサポートするか</h3><p><a target="_blank" href="http://www.infoq.com/news/2013/12/retrospectives-learn-leanstartup"><em>原文(投稿日：2013/12/05)へのリンク</em></a></p>
<div class="article_page_left news_container text_content_container"> 
 <div class="text_info"> 
  <p>リーンスタートアップの「構築-計測-学習」というフィードバックループは、起業家が顧客のニーズについて学ぶのに役に立つ。アジャイルの「ふりかえり」は、必要とされる変化について考え、学び、そして合意するための方法だ。以下では、アジャイルのふりかえりが、リーンスタートアップの学習と行動をどのようにサポートするのか、いくつかの事例を挙げる。</p> 
  <p>Michelle Serro氏は「<a href="http://www.fastcompany.com/3012877/dialed/3-rules-every-entrepreneur-should-live-by">3 rules every entrepreneur should live by</a>」というブログ記事で、アジャイルのふりかえりから得られたメリットについて紹介した。</p> 
  <blockquote> 
   <p>アジャイルの「ふりかえり」は、ある期間の終わりに開くミーティング (…) のことです。チーム全員が集まって、できたこと、できなかったこと、見えてきたチャンスや直面している課題について話し合います。繰り返すたびに新しく学んだことを踏まえて、自分たちが定めたアプローチがまだ意味をなしているかをチェックし、問いかけることが目的です。</p> 
  </blockquote> 
  <p>Michelle氏は、ふりかえりから学んだ、ふりかえりをうまくやる3つの重要なルールについて書いている。第一のルールは「早期に認識しよう。頻繁に解決しよう」だ。ふりかえりを使うことで、ポジティブな雰囲気で問題を素早く解決する。</p> 
  <blockquote> 
   <p>素晴しい仕事をするのに妨げとなるものが何かを認識したいと考えていました。それがミーティングの事実上のアジェンダになっていました。あなたの妨げになるものとは何でしょうか？ そして、どうすればその障害物を協力して取り除けるのでしょうか？ ゴールはできる限り素早く学んで改善することです。</p> 
  </blockquote> 
  <p>第二のルールは「オートパイロットを無効にせよ」だ。これは警戒を怠らないようにするのに役に立つ。</p> 
  <blockquote> 
   <p>アジャイルでは、はっきり聞かない限り、万事OKだと想定してはいけません。重要なことは、チームとして、会社として、 日々受け取る全ての新しいインプットを考慮し、最善の道にいるかどうかを絶えず問い掛けることです。</p> 
  </blockquote> 
  <p>第三のルールは「ピボットする計画を立てよ」だ。Michelle氏が説明するように、これはふりかえりをリーンスタートアップに合わせたものだ。</p> 
  <blockquote> 
   <p>ふりかえりが求めているのは、単に先週のことをふりかえるのではなく、当初の意図まで遡って全てをふりかえることです。さらには、必要になりそうな最初のヒントが得られたら、すぐにチーム全体が劇的な方針の変化を受け入れるのに備えるのです。やってきたことを全部捨てて、最初からやり直すということではありません。始めた当初のビジネスとは全く関係ないかもしれませんが、もっと良いチャンスを見つけるのに精神的にオープンになるということです。</p> 
  </blockquote> 
  <p>「変化しないビジネスモデルキャンバスは、変化しない60ページのビジネスプランと同じくらい役に立ちません」Tristan Kromer氏は自身のブログ記事「<a href="http://grasshopperherder.com/the-one-minute-retro/">the one minute retro</a>」でこう言った。彼は、ふりかえりはリーンスタートアップの基礎に取り掛かるのに役に立つと考えている。1分間のふりかえりは、彼にとってふりかえりを習慣づける手段であると説明している。</p> 
  <blockquote> 
   <ol> 
    <li>タイマーを1分に設定します。</li> 
    <li>みんなにこう尋ねます。「このスプリント/ミーティング/1日/2週間で、ビジネス/ミーティング形式/コーディングプラクティス/昼食の注文のやり方で、変えたい、あるいは、改善したいことを1つ挙げてください」</li> 
    <li>タイマーをスタートします。</li> 
    <li>付箋紙に何か書いてください。</li> 
    <li>タイマーが切れたら、フィードバックを集めます。</li> 
   </ol> 
   <p>ふりかえりの主催者は、フィードバックを受け取って、次の期間で改善するものを1つだけ選びます。</p> 
  </blockquote> 
  <p>継続するためには、1分間のふりかえりから学んだことを1つだけ選ぶのが重要だとTristan氏は説明する。</p> 
  <blockquote> 
   <ul> 
    <li>（プロセス改善や技術仕様に存在する）仕様変更を制限しましょう。</li> 
    <li>ポジティブな進歩を見せやすくして、チームに小さな勝利をもたらしましょう。</li> 
    <li>何だかんだ言っても、短いスプリントであなたがやれることはそれくらいなのです。</li> 
   </ul> 
  </blockquote> 
  <p>1分間のふりかえりは、限られた時間で学び、すぐに勝利を実感するのに役に立つとTristan氏は言っている。</p> 
  <blockquote> 
   <p>ここで重要なことは、完璧なふりかえりをするのではなく、ふりかえりを習慣づけることです。 (…) 基本を身に付けるまでは、詳細に踏み込んでも意味がありません。</p> 
  </blockquote>
 </div> 
</div><br><br><br><br><br><br></body></html>